Repository: Taapeli/stk-upload
Catalog: app/static/translations/*.po
Languages: fi

source: Undefined
fi: Määrittelemätön

source: Finnish
fi: suomi

source: Swedish
fi: ruotsi

source: English
fi: englanti

source: Email or Username
fi: Sähköposti tai käyttäjätunnus

source: Password
fi: Salasana

source: Remember Me
fi: Muista minut

source: Login
fi: Kirjautuminen

source: Email address
fi: Sähköposti

source: I have read and agree the <a href='static/termsofuse.html'>Terms of use</a>
fi: Hyväksyn <a href='static/termsofuse.html'>käyttöehdot</a>

source: Register
fi: Rekisteröidy

source: Please indicate that you have read and agree to the Terms and Conditions
fi: Olen lukenut ja hyväksynyt käyttöehdot

source: Email address has been confirmed earlier
fi: Sähköpostisi on jo vahvistettu

source: Email address has not been approved yet
fi: Sähköpostiasi ei ole vahvistettu vielä

source: Email address must be an authorized one
fi: Vain vahvistettua sähköpostiosoitetta käytetään

source: Username has been reserved already
fi: Tämä käyttäjätunnus on jo varattu

source: Username
fi: Käyttäjätunnus

source: Name
fi: Nimi

source: Language
fi: Kieli

source: Language required
fi: Kieli on pakollinen

source: User name
fi: Käyttäjätunnus

source: undefined relation
fi: tuntematon suhde

source: No person or family has uses this source
fi: Tätä lähdettä ei ole kenelläkään henkilöllä tai perheellä

source: Not valid field names "Name,Refname,Reftype,Source,Gender" {}
fi: Kelpaamattomia kenttänimiä "Name,Refname,Reftype,Source,Gender" {}

source: id:
fi: tunnus:

source: Id of the user
fi: Käyttäjän id

source: Email Address:
fi: Sähköpostiosoite:

source: Username:
fi: Käyttäjätunnus

source: Name:
fi: Nimi

source: Name of the user
fi: Nimi

source: Is active
fi: aktiivinen

source: Active / passive user
fi: Käyttäjä on nyt aktiivinen / passivinen

source: Roles
fi: Roolit

source: Gedcom-files
fi: Gedcom-tiedostot

source: Member
fi: Jäsen

source: Research
fi: Tutkija

source: Audit
fi: Auditoija

source: Admin
fi: Pääkäyttäjä

source: Assigned roles
fi: Roolit

source: Email confirmed time
fi: Sähköposti vahvistettu

source: Time of email confirmation
fi: Aika jolloin sähköpostivahvistus on tehty

source: Last login time
fi: Viimeinen kirjautuminen

source: Time of last login
fi: Aika jolloin viimeksi on kirjauduttu sisään sovellukseen

source: Last login IP address
fi: Viimeksi käytetty IP-osoite

source: IP address of last login
fi: IP-osoite josta on viimeksi kirjauduttu sisään sovellukseen

source: Current login time
fi: Kirjautumisaika

source: Time of current login
fi: Aika jolloin on viimeksi kirjaduttu sisään sovellukseen

source: Current login IP address
fi: Nykyinen IP-osoite

source: IP address of current login
fi: Tässä istunnossa käytetty IP-osoite

source: Login count
fi: Kirjautumiskertoja

source: Count of logins
fi: Kirjautumiskertojen lukumäärä

source: Update user
fi: Päivitä käyttäjätietoja

source: Maximum 100 characters
fi: Enintään 100 merkkiä

source: Enter the email address
fi: Syötä sähköpostiosoite

source: Default role:
fi: Oletusrooli:

source: Enter the default role
fi: Syötä oletusrooli

source: Add user candidate
fi: Lisää käyttäjäehdokas

source: Role
fi: Rooli

source: Assigned role choices
fi: Roolivaihtoehdot

source: Approved
fi: Hyväksytty

source: Approved / pending user
fi: Hyväksytty / odottava käyttäjä

source: Creator:
fi: Luonut:

source: User name of creator
fi: Tunnuksen luonut

source: Email creation time
fi: Sähköpostin luontiaika

source: Time of allowed email creation
fi: Aikaa luontiin käytettävissä

source: Time of registered email confirmation
fi: Sähköpostin rekistoröinnin vahvistus

source: Update allowed email
fi: Päivitä hyväksytty sähköpostiosoite

source: Database initial check done.
fi: Tietokannan alkutarkastus tehty.

source: No empty batches removed
fi: Ei poistettavia tyhjiä eriä

source: estimated lifetime
fi: arvioitu elinaika

source: Allowed email updated
fi: Sallitut sähköpostiosoitteet päivitetty

source: User updated
fi: Käyttäjätiedot päivitetty

source: Data import from %(i)s to database has been started.
fi: Tuonti tiedostosta %(i)s on alkanut.

source: UPLOADED
fi: LADATTU

source: STORING
fi: MENOSSA TIETOKANTAAN

source: STORED
fi: TIETOKANNASSA

source: FAILED
fi: EPÄONNISTUI

source: ERROR
fi: VIRHE

source: REMOVED
fi: POISTETTU KANNASTA

source: User {} has not admin privileges
fi: Käyttäjällä {} ei pääkäyttäjän oikeuksia

source: All data is deleted.
fi: Kaikki tiedot poistettu.

source: All data but users and roles are removed.
fi: Kaikki tiedot poistettu paitsi käyttäjät rooleineen.

source: All persons and event by %(un)s are removed.
fi: Kaikki käyttäjän %(un)s tuomat henkilöt ym on poistettu.

source: Removed %(cnt)d nodes
fi: Poistettu %(cnt)d nodea

source: Given allowed email address already exists
fi: Annettu sähköpostiosoite jo käytössä

source: Management of access to batches
fi: Tutkija-aineistojen käyttöoikeuksien hallinta

source: Add access for user
fi: Lisää oikeus käyttäjälle

source: to batchid
fi: erään

source: Add access
fi: Lisää oikeus

source: Current accesses
fi: Voimassa olevat käyttöoikeudet

source: User
fi: Käyttäjä

source: Batch
fi: Erä

source: Objects
fi: Kohteita

source: Delete marked
fi: Poista merkityt

source: Administrator
fi: Pääkäyttäjä

source: Are you sure you want to clear the database?
fi: Haluatko todella tyhjentää tietokannan?

source: Are you sure you want to delete your data?
fi: haluatko todella poistaa tuomasi tiedot?

source: Isotammi Database Management Operations
fi: Isotammi-tietokannan hallinta

source: with roles
fi: rooleina

source: Git Application Version
fi: Sovellusversio

source: Database Emptyings
fi: Tietokannan tyhjennykset

source: Dangerous operations, which can not be undone!
fi: Vaarallisia toimintoja, joita ei voi perua!

source: Clear the entire database
fi: Tyhjennä koko tietokanta

source: Clear the database but save user IDs
fi: Tyhjennä tietokanta, säästä käyttäjät rooleineen

source: Delete all my imported data
fi: Poista kaikki tarjokasaineistoni

source: My Home Page
fi: Omat tiedot

source: Database refresh
fi: Virkistä

source: Safely check and initiate important nodes, constraints and schema fixes
fi: Tärkeiden tietojen, rajoitusten ja rakennemuutosten turvallinen tarkastus

source: User and reference information management
fi: Käyttäjien ja referenssitietojen hallinta

source: Usernames and uploaded materials
fi: Käyttäjätunnukset ja tiedostot

source: User candidates
fi: Kutsutut käyttäjät

source: Active and pending users
fi: Aktiiviset ja odottavat käyttäjät

source: Access management
fi: Tutkijan aineiston käyttöoikeudet

source: Users and roles table
fi: Käyttäjät ja roolit

source: Data maintenance
fi: Tietojen huolto

source: Set the estimated birth and death dates of a person
fi: Aseta henkilöiden arvioidut syntymä- ja kuolinajat

source: Application management
fi: Sovelluksen hallinta

source: Display application log
fi: Näytä sovelluksen loki

source: List all application pages
fi: Kaikkien sivujen luettelo

source: Server statistics
fi: Palvelintilastot

source: User candidates from database
fi: Käyttäjäehdokkaat kannasta

source: Notifications
fi: Ilmoitukset

source: Create a new user candidate
fi: Luo uusi käyttäjäehdokas

source: Show
fi: Näytä

source: all users
fi: kaikki käyttäjät

source: registered users
fi: rekisteröityneet käyttäjät

source: pending candidates
fi: rekisteröitymättömät ehdokkaat

source: Pending user candidates
fi: Odottavat käyttäjäehdokkaat

source: email
fi: sähköpostiosoite

source: role
fi: rooli

source: approved
fi: hyväksytty

source: creator
fi: luonut

source: created
fi: luotu

source: registered
fi: rekisteröity

source: Edit
fi: Muokkaa

source: No data
fi: Ei tietoja

source: Operations for selected users
fi: Toiminnot valituille käyttäjille

source: Send email
fi: Lähetä sähköposti

source: Delete unregistered users
fi: Poista rekisteröimättömät käyttäjät

source: Empty batches
fi: Tyhjät tuontierät

source: Empty batches for user
fi: Tyhjär erät käyttäjälle

source: Selected Batch
fi: Valittu tuontierä

source: Number of empty batches
fi: Tyhjiä eriä

source: Removed %(n)s batches
fi: Poistettu %(n)s tuontierää

source: The empty batches will be removed, except those which are created today.
fi: Tyhjät erät poistetaan, paitsi tänään luodut.

source: Remove
fi: Poista

source: GEDCOMs
fi: gedcomit

source: GEDCOMs for user
fi: Gedcom-tiedostot käyttäjältä

source: GEDCOMs for %(n)s users
fi: Gedcomit %(n)s käyttäjältä

source: GEDCOMs for all users
fi: Gedcom-tiedostot kaikilta käyttäjiltä

source: User id
fi: Käyttäjätunnus

source: GEDCOM file
fi: Gedcom-tiedosto

source: Number of files
fi: Tiedostojen lukumäärä

source: List of users
fi: Käyttäjälistaus

source: Admin pages
fi: Ylläpitäjän sivut

source: Admin-Start Page
fi: Ylläpitäjän alkusivulle

source: My profile
fi: Käyttäjäprofiilini

source: The Genealogical Society of Finland
fi: Suomen Sukututkimusseura

source: Change settings
fi: Muuta asetuksia

source: Select displayed data
fi: Valitse näytettävät tiedot

source: Admin home
fi: Admin etusivu

source: Version
fi: versio

source: Database Information
fi: Tiedot kannasta

source: Active User names
fi: Aktiiviset käyttäjät

source: active users only
fi: vain aktiiviset käyttäjät

source: inactive users only
fi: vain suljetut käyttäjät

source: Active
fi: Aktiivinen

source: Inactive
fi: Suljettu

source: Edit me
fi: Muokkaa profiiliani

source: No users
fi: Ei käyttäjiä

source: Gramps Files and Candicate Materials
fi: Ehdokasaineistot ja Gramps-tiedostot

source: Uploaded GEDCOMs
fi: Ladatut gedcomit

source: Isotammi User List
fi: Isotammen käyttäjät

source: Show uploaded Gramps files
fi: Näytä tuodut Gramps-tiedostot

source: Users and user candidates
fi: Käyttäjät ja käyttäjäehdokkaat

source: <th>email</th><th>role</th><th>creator</th><th>created</th><th>registered</th>
fi: <th>sähköposti</th><th>rooli</th><th>luoja</th><th>luotu</th><th>rekisteröity</th>

source: Pending
fi: odottaa

source: Add a new user candidate
fi: Lisää käyttäjäehdokas

source: Gramps to Neo4j log
fi: Lokitiedot siirrosta Grampsista tietokantaan

source: Log of Gramps XML upload
fi: Loki Gramps-tiedoston latauksesta palvelimelle

source: Return
fi: Palaa

source: Send email to users
fi: Sähköpostia käyttäjille

source: Message sent
fi: Viesti lähetetty

source: Message send failed
fi: Viestin lähetys epäonnistui

source: Write a message
fi: Kirjoita viesti

source: Subject
fi: Aihe

source: Message from Isotammi admin
fi: Viesti Isotammen ylläpitäjältä

source: Message
fi: Viesti

source: Apply
fi: Lähetä

source: Syslog
fi: Järjestelmän loki

source: Time
fi: Aika

source: Type
fi: Tyyppi

source: Content
fi: Sisältö

source: Older events
fi: Vanhemmat tapahtumat

source: Newer events
fi: Uudemmat tapahtumat

source: Back
fi: Takaisin

source: Update allowed_email
fi: Päivitä hyväsytyt sähköpostiosoitteet

source: Allowed email list
fi: Hyväksytyt sähköpostiosoitteet

source: User list
fi: Käyttäjäluettelo

source: Uploads
fi: Lataukset

source: Uploads for user
fi: Lataukset käyttäjältä

source: Uploads for %(n)s users
fi: Lataukset %(n)s käyttäjältä

source: Uploads for all users
fi: Kaikkien käyttäjien lataamat tiedostot

source: Status for differents steps in XML file upload:
fi: Syöttötiedoston käsittelyvaiheet

source: the file has been uploaded to server
fi: tiedosto on talletettu palvelimelle

source: the file content is being stored to the database
fi: tiedostoa viedään tietokantaan

source: the file content has been stored to the database
fi: tiedot on talletettu tietokantaan

source: not found any more
fi: poistettu

source: there was an error
fi: päättyi virheeeseen

source: Gramps file / uploaded at
fi: Gramps-tiedosto / ladattu

source: Status
fi: Tila

source: Operations
fi: Toimenpiteet

source: me
fi: minä

source: deleted from database
fi: poistettu kannasta

source: batch %(batch_id)s; %(persons)d persons
fi: erä %(batch_id)s; %(persons)d henkilöä

source: Store to database
fi: Vie tietokantaan

source: Show log
fi: Näytä loki

source: Delete file
fi: Poista tiedosto

source: Done
fi: Tehty

source: Data type '{}' is not supported
fi: Tietotyyppiä '{}' ei tueta

source: Missing proper column title:
fi: Kelvollinen sarakeotsikko puuttuu:

source: No objects transferred:
fi: Mitään ei siirretty:

source: moved %(new_rel)s objects to
fi: siirretty %(new_rel)s kohdetta

source: a new Common data set
fi: uuteen Isotammi-aineistoerään

source: Common data set
fi: Isotammi-aineistoon

source: Transfer succeeded:
fi: Siirto onnistui:

source: Auditions
fi: Hyväksytyt aineistot

source: Auditions and Amount of Objects
fi: Isotammen aineistoerät ja kohteiden lukumäärä

source: Total <b>%(tot)s</b> objects
fi: Yhteensä <b>%(tot)s</b> kohdetta

source: Auditor
fi: Auditoija

source: Researcher
fi: Tutkija

source: Batch id
fi: Aineistotunnus

source: Batches
fi: Tutkijan aineistoja

source: Download file
fi: Tallenna tiedostona

source: Move to Isotammi database
fi: Siirrä Suomi-kantaan

source: Isotammi auditor
fi: Auditoija

source: Table format tools
fi: Taulukkonäkymiä

source: The data includes accepted and candidate materials of all users.
fi: Mukana on sekä hyväksytyt tiedot että kaikki tarjokasaineistot.

source: Select a batch to be moved to Isotammi database
fi: Valitse Suomi-kantaan siirrettävä erä

source: Remove empty batches
fi: Poista tyhjät tuontierät

source: List approved Isotammi data sets
fi: Isotammen aineistorät

source: all
fi: kaikki

source: approved by me
fi: itse hyväksymäni

source: Reference names
fi: Referenssinimet

source: Experimental place merge
fi: Paikkojen yhdistely (kokeellinen)

source: Back to Front Page
fi: Palaa etusivulle

source: Audit home
fi: Auditoijan etusivu

source: Instructions
fi: Ohjeita

source: Material for Isotammi database
fi: Siirto Suomi-kantaan

source: Moving batch to Isotammi database
fi: Siirretään tuontierä Suomi-kantaan

source: saved at
fi: talletettu

source: Total %(cnt)s nodes from user <b>%(user)s</b>.
fi: Yhteensä %(cnt)s kohdetta tutkijalta <b>%(user)s</b>.

source: Go back without changes
fi: Palaa ilman muutoksia

source: – There is no more data to move in this batch
fi: – Aineistossa ei ole enempää siirrettävää

source: Logged on user
fi: Kirjautunut käyttäjä

source: Handling reference materials
fi: Referenssiaineistojen käsittely

source: Adding data
fi: Tietojen lisääminen

source: Download reference names
fi: Lataa referenssinimiä

source: Destroying <u>all former</u> and creating a unique index
fi: Tuhotaan <u>kaikki entiset</u> ja luodaan yksikäsitteinen indeksi

source: Upload
fi: Lähetä

source: Handling reference names
fi: Referenssinimien käsittely

source: Listings
fi: Listaukset

source: List reference names
fi: Listaa referenssinimet

source: See people with reference names
fi: Katso ihmiset referenssinimineen

source: Set changed reference names for all people
fi: Aseta muuttuneet referenssinimet kaikille ihmisille

source: Reference name Editor
fi: Referenssinimien editointi

source: Download reference names as a CSV file
fi: Talleta CSV-referenssinimitiedosto koneellesi

source: Data stored
fi: Tiedot talletettu

source: Store to Database
fi: Tietojen talletus kantaan

source: Go back
fi: Paluu

source: Duplicates search
fi: Duplikaattien haku

source: Data Batches
fi: Tutkijan tuontierät

source: Select
fi: Valitse

source: File
fi: Tiedosto

source: Has searchkeys
fi: Sisältää hakuavaimet

source: Search in
fi: Etsi kohteista

source: Search duplicates
fi: Etsi tuplat

source: Generate comparison keys
fi: Generoi vertailuavaimet

source: Remove comparison keys
fi: Poista vertailuavaimet

source: Upload training data
fi: Lataa algoritmin koulutusaineistoa

source: Create index
fi: Luo indeksi

source: Drop index
fi: Poista indeksi

source: GEDCOM Analyzer
fi: Gedcom-analysointi

source: count=%(num)d, line %(lines)s
fi: %(num)d kpl, rivillä %(lines)s

source: Count
fi: Lukumäärä

source: Invalid tag hierarchy
fi: Virheellinen hierarkia

source: No value
fi: Ei arvoa

source: Invalid dates
fi: Virheellisiä päivämääriä

source: Too many child tags
fi: Liian monta alariviä

source: Records for submitters
fi: Tutkijakohtaiset tietueiden lukumäärät

source: Families with no parents
fi: Perheet joilla ei vanhempia

source: With sources
fi: Lähteillä varustetut

source: Without sources
fi: Ilman lähteitä

source: Places without hierarchy
fi: Paikat ilman hierarkiaa

source: Possibly invalid surnames
fi: Ehkä viallisia sukunimiä

source: Possibly invalid firstnames
fi: Ehkä viallisia etunimiä

source: Genders
fi: Sukupuolet

source: Submitters
fi: Tutkijat

source: Missing paths
fi: Puuttuvat pakolliset tiedot

source: TYPEs for %(parent_path)s
fi: TYPE-kentän arvot %(parent_path)s-rakenteissa

source: Invalid pointers
fi: Vialliset osoittimet

source: Missing records
fi: Puuttuvat tietueet

source: Unused records
fi: Käyttämättömät tiedot

source: Gedcoms
fi: gedcomit

source: Current file
fi: Nykyinen tiedosto

source: File {} saved as {}
fi: Tiedosto {} talletettu nimelle {}

source: Choose a GEDCOM file to upload
fi: Valitse ladattava gedcom-tiedosto

source: This GEDCOM file already exists
fi: Gedcom-tiedosto on jo olemassa

source: You don't have permission to view that GEDCOM
fi: Sinulla ei ole oiketta katsoa tätä Gedcom-tiedostoa

source: That GEDCOM file does not exist on the server
fi: Tätä Gedcom-tiedostoa ei ole palvelimella

source: Invalid line:
fi: Rivi ei kelpaa:

source: Invalid GEDCOM at line: {}
fi: Kelvoton ilmaus rivillä: {}

source: Invalid GEDCOM; no level %s lines
fi: Virheellinen Gedcom; ei tason %s rivejä

source: Added:
fi: Lisätty:

source: Deleted:
fi: Poistettu:

source: Replaced:
fi: Korvattu:

source: With:
fi: tällä:

source: Transform '{}' started at {}
fi: Muunnos '{}' käynnistettiin {}

source: Name of the input GEDCOM file
fi: Gedcom-tiedoston nimi

source: Name of the log file
fi: Lokitiedoston nimi

source: Display changed rows
fi: Näytä muutetut rivit

source: Do not produce an output file
fi: Älä tuota tulostiedostoa

source: Do not produce a log in the output file
fi: Älä tuota lokia tulostiedostoon

source: Encoding of the input GEDCOM
fi: Gedcom-tiedoston merkkikoodaus

source: Total {num} change
fi: Yhteensä {num} muutos

source: File saved as {}
fi: Tiedosto talletettu nimelle {}

source: Old file saved as {}
fi: Vanha versio talletettu nimelle {}

source: Transform '{}' ended at {}
fi: Muunnos '{}' päättyi {}

source: Unsupported type:
fi: Tyyppiä ei tueta:

source: Back to Top
fi: Palaa alkuun

source: A Database of the Genealogical Society of Finland
fi: Suomen Sukututkimusseuran tietokanta

source: Gedcom tools
fi: Gedcom-työkalut

source: user
fi: käyttäjätunnus

source: Description
fi: Kuvaus

source: Update description
fi: Päivitä kuvaus

source: Allow help desk to view data
fi: Salli Tukitoiminnon tarkastella tietoja

source: Permission updated
fi: Lupa päivitetty

source: Show GEDCOM info
fi: Näytä tiedot

source: Switch to another GEDCOM
fi: Vaihda käsiteltävä tiedosto

source: Statistics
fi: Tietoja

source: Upload time
fi: Viety palvelimelle

source: File size
fi: Tiedoston koko

source: bytes
fi: tavua

source: Gedcom date
fi: Aineiston päivämäärä

source: Submitter
fi: Tutkija

source: Gedcom version
fi: Gedcom-versio

source: Encoding
fi: Havaittu merkistö

source: Gedcom charset
fi: Ilmoitettu merkistö

source: Source program
fi: Käytetty ohjelma

source: Number of individuals
fi: Henkilöitä

source: Number of families
fi: Perheitä

source: Number of unique places
fi: Paikkoja

source: Number of notes
fi: Lisätietoja

source: Number of citations
fi: Lähdeviittauksia

source: Number of sources
fi: Lähteitä

source: Number of repositories
fi: Arkistoja

source: Number of multimedia objects
fi: Liitetiedostoja

source: Actions
fi: Toiminnot

source: Choose a transformation to perform for this GEDCOM
fi: Valitse muunnos

source: Choose a transformation
fi: Valitse muunnos

source: Display previous versions of this GEDCOM
fi: Näytä edellinen versio

source: Versions management
fi: Versioiden hallinta

source: Fetch this GEDCOM
fi: Nouda tämä tiedosto työasemallesi

source: Remove this GEDCOM
fi: Poista tämä Gedcom palvelimelta

source: Technical analysis
fi: Tekninen analyysi

source: Show transformation history
fi: Näytä muunnoshistoria

source: Transformations
fi: Muunnokset

source: Versions
fi: Versiot

source: Delete old versions
fi: Poista vanhat versiot

source: Compare versions
fi: Vertaile versioita

source: No previous versions
fi: Ei aiempia versioita

source: Transformation history
fi: Muunnoshistoria

source: GEDCOM comparison
fi: Tiedostoversioiden vertailu

source: Results
fi: Tulokset

source: Perform transformation
fi: Suorita muunnos

source: Transformation results
fi: Muunnoksen tulokset

source: Old version is saved as
fi: Vanha versio tallennetaan nimellä

source: Revert to old version
fi: Palauta vanha versio

source: Not saved yet
fi: Ei vielä tallennettu

source: Save result
fi: Tallenna tulos

source: Select your file for processing
fi: Valitse käsiteltävä tiedosto

source: Upload a new GEDCOM file
fi: Lataa uusi Gedcom-tiedosto

source: Return main page
fi: Paluu etusivulle

source: transformation options
fi: muunnoksen vaihtoehdot

source: Setting
fi: Asetus

source: Value
fi: Arvo

source: Add
fi: Lisää

source: Default
fi: Oletusarvo

source: check all
fi: Valitse kaikki

source: Citations in notes
fi: Lähdeviitteet lisätiedoissa

source: Dates
fi: Päivämäärät

source: Correct some invalid date formats
fi: Korjaa virheellisiä päivämääriä

source: Display invalid dates
fi: Näytä virheelliset päivämäärät

source: Change 31.12.1999 to 31 DEC 1999
fi: 31.12.1999 -> 31 DEC 1999

source: Change 1999-12-31 to 31 DEC 1999
fi: 1999-12-31 -> 31 DEC 1999

source: Change 1999-12 to DEC 1999
fi: 1999-12 -> DEC 1999

source: Change [00.]12.1999 to DEC 1999
fi: [00.]12.1999 -> DEC 1999

source: Change 00 DEC 1999 to DEC 1999
fi: 00 DEC 1999 -> DEC 1999

source: Change 1950-[19]59 to FROM 1950 TO 1959
fi: 1950-[19]59 -> FROM 1950 TO 1959

source: Change 1950-/>1950 to FROM/AFT 1950
fi: 1950-/>1950 -> FROM/AFT 1950

source: Change -1950/<1950 to TO/BEF 1950
fi: -1950/<1950 -> TO/BEF 1950

source: Invalid dates:
fi: Virheellisiä päivämääriä:

source: %(date)s (line %(linkstr)s)<br>
fi: %(date)s (rivillä %(linkstr)s)<br>

source: Baptisms
fi: Kasteet

source: Marriages
fi: Aviot

source: Splitting of data in PLAC of MARR
fi: Aviopaikan (PLAC) hajoittaminen

source: Personal names
fi: Henkilönimet

source: Mark missing name parts as "N"
fi: Puuttuva nimiosa merkitään "N":llä

source: Recognize_patronymes
fi: Tunnista patronyymit

source: Call names and aliases
fi: Kutsumanimet ja ailakset

source: Create surname history from multiple names
fi: Luo sukunimien ketju monista nimistä

source: Process_nonstd_ALIA_lines
fi: Käsittele epästandardit ALIA-rivit

source: Places
fi: Paikat

source: Tries to recognize place names and order them correctly
fi: Yrittää tunnistaa paikannimet ja asettaa ne oikeaan järjestykseen

source: Display all unique places
fi: Näytä kaikki paikannimet

source: Reverse the order of places
fi: Käännä paikkojen järjestys

source: Replace spaces with commas
fi: Korvaa välilyönnit pilkuilla

source: Ignore lowercase words
fi: Ohita pienillä kirjoitetut sanat

source: Ignore numeric words
fi: Ohita numeeriset sanat

source: Ignore words shorter that minlen
fi: Ohita sanat jotka lyhyempiä kuin

source: Try to discover correct order...
fi: Yritä löytää oikea järjestys ...

source: Try to combine certain names...
fi: Yritä yhdistää tiettyjä nimiä ...

source: Add this name at the end
fi: Lisää tämä nimi loppuun

source: Bypass foreign countries
fi: Ohita ulkomaiden paikat

source: Display unique changed places
fi: Näytä uniikit muunnetut paikat
