Repository: Taapeli/stk-upload
Catalog: app/static/translations/*.po
Languages: fi

source: Display unchanged places
fi: Näytä muuttumattomat paikat

source: Display ignored places
fi: Näytä ohitetut paikat

source: Only process places containing this string
fi: Käsittele vain paikat joissa tämä merkkijono

source: Replace changed PLAC tags with PLAC-X
fi: Korvaa muutetut PLAC-tunnisteet PLAC-X:llä

source: Replace all matching PLAC tags with PLAC-X
fi: Korvaa PLAC-tunnisteet PLAC-X:llä kaikille hakuehtoon sopiville paikoille

source: Internal error
fi: Sisäinen virhe

source: All unique place names:
fi: Kaikki eri paikannimet

source: Count of all places:
fi: Kaikkien paikkojen lukumäärä:

source: Count of unique places:
fi: Erinimisten paikkojen lukumäärä:

source: Place names changed:
fi: Muuttuneet paikannimet:

source: Old name
fi: Vanha nimi

source: New name
fi: Uusi nimi

source: Place names not changed:
fi: Muuttumattomat paikannimet:

source: ignored:
fi: ohitettu:

source: Fixes problems in Sukuohjelmisto 2004 Gedcoms
fi: Korjaa Sukuohjelmisto 2004:n tuottamissa Gedcomeissa

source: Change custom tags to EVENs
fi: Muuta epästandardit tapahtuman EVEN-tapahtumiksi

source: Change _PHOTO tags to OBJEs
fi: Muuta _PHOTO-merkinnät OBJE-merkinnöiksi

source: Change MARR to MARB if TYPE=Kuulutus
fi: Muuta MARR-tapahtumat MARB-tapahtumiksi jos TYPE=Kuulutus

source: Remove empty CONT lines under SOUR
fi: Poista tyhjä CONT-rivit SOUR-merkinnöistä

source: Combine PLAC and ADDR
fi: Yhdistä PLAC- ja ADDR-merkinnät

source: Sukujutut transformations
fi: Sukujutut muunnokset

source: Remove invalid DATE tags
fi: Poista virheelliset DATE-tunnisteet

source: Remove empty NOTE tags
fi: Poista tyhjät NOTE-tunnisteet

source: Remove DATE AVOLIITTO tags
fi: Poista DATE AVOLIITTO-tunnisteet

source: Remove invalid DATEs for DIV tags
fi: Poista DIV tunnisteiden virheelliset DATE-tiedot

source: Remove empty GIVN and SURN tags
fi: Poista tyhjät GIVN- ja SURN-tunnisteet

source: Remove duplicate SOUR lines under NAME
fi: Poista tupla SOUR rivit NAME-tunnisteryhmässä

source: Remove REFN tags
fi: Poista REFN-tunnisteet

source: Remove STAT tags
fi: Poista STAT-tunnisteet

source: Move level 3 NOTEs to level 2 to save them
fi: Muuta 3-tason NOTE-tunnisteet 2-tasolle, niiden säästämiseksi

source: Insert ADR1 tags under ADDR
fi: Lisää ADR1-tunnisteet ADDR-tunnisteryhmään

source: Change PLAC tags to NOTEs under certain events
fi: Vaihda eräissä tapahtumissa PLAC-tunnisteet NOTE-tunnisteiksi

source: Change event types "Kaksonen" and "Kolmonen" to NOTEs
fi: Muuta "Kaksonen" ja "kolmonen" tapahtumatyypit NOTE-riveiksi

source: Remove trailing and multiple consecutive spaces in person and place names
fi: Poista alku- ja peräkkäiset välilyönnit henkilön ja paikan nimistä

source: Change EMIG to RESI
fi: Vaihda EMIG-tunniste RESI-tunnisteeseen

source: Move an event NOTE to citation PAGE
fi: Siirrä lisätieto lainauksen Osa/Sivu-tietoon

source: Move a SOUR under NOTE to upper level
fi: Siirrä SOUR ylemmän tason NOTE:n alle

source: Unmark
fi: Poista tag-X-merkinnät

source: Restores marked tags: <tag>-X -> <tag>
fi: Poistaa "-X"-merkityistä tunnisteista "-X" :n

source: Database save failed due to {} {}
fi: Talletus tietokantaan epäonnistui, syy {} {}

source: Batch id %(batch_id)s has been deleted
fi: Tuontierä %(batch_id)s on poistettu

source: Database save failed
fi: Talletus tietokantaan epäonnistui

source: Gramps to Neo5j analyze
fi: Analysoi saapuva Gramps-aineisto

source: Analyze of the Gramps XML
fi: Gramps-tiedoston analyysi

source: Objects ...
fi: Kohteet ...

source: referring
fi: viittaavat

source: Isotammi User's Candidate Material
fi: Tutkijan tarjokasaineisto

source: Candidate material xml files
fi: Tarjokasaineiston XML-tiedostot

source: Send data to server
fi: Aineiston lähettäminen

source: Select Gramps XML File (*.gramps etc) for converting to your candidate material
fi: Valitse Gramps-tiedosto (.gramps tai .gpkg) tarjokasaineistoksi

source: Send
fi: Lähetä

source: My files and materials
fi: Tutkijan tiedostot ja tarjokasaineistot

source: Manage your uploaded files and the candidate materials which you have stored in the database.
fi: Hallinnoi tallettamiasi tiedostoja ja tarjokasaineistojasi tietokannassa.

source: List my data sets
fi: Näytä tarjokasaineistoni

source: List my uploads
fi: Tiedostoluettelo

source: Gramps to Neo5j log
fi: Loki Grampsin-tiedoston tallentamisesta tietokantaan

source: Log of storing Gramps XML into database
fi: Loki Grampsin-tiedoston tallentamisesta tietokantaan

source: Operation
fi: Toimenpide

source: Time / sec
fi: Aika sekunneissa

source: Uploads from Gramps
fi: Grampsista ladatut aineistot

source: Are you sure you want to delete the XML file?
fi: Haluatko todella tuhota tämän Gramps-tiedoston?

source: Are you sure you want to delete this batch from database?
fi: Haluatko varmasti poistaa tämän tarjokasaineiston?

source: Uploaded Candidate Materials
fi: Talletetut tarjokasaineistot

source: Steps for uploading Gramps files
fi: Gramps-tiedoston käsittelyvaiheet

source: Not found any more
fi: Tarjokasaineisto poistunut

source: Gramps file
fi: Gramps-tiedosto

source: Person count
fi: Henkilöitä

source: Operations for
fi: Toiminnot tiedostolle

source: the selected file
fi: valittu tiedosto

source: Saving data
fi: Talletetaan

source: Download the Gramps file
fi: Talleta tiedosto koneellesi

source: Analyze the Gramps file
fi: Analysoi Gramps-tiedosto

source: Show last log
fi: Näytä viimeisin loki

source: Delete data
fi: Poistetaan

source: Delete the file
fi: Tuhoa tiedosto

source: Delete from database
fi: Poista tietokannasta

source: Send a new Gramps file
fi: Tuo uusi Gramps-tiedosto

source: Look at your candidate materials
fi: Katso tarjokasaineistoasi

source: Return to front page
fi: Palaa etusivulle

source: husband
fi: mies

source: wife
fi: vaimo

source: No objects found
fi: Ei kohteita

source: Error
fi: Virhe

source: Event details
fi: Tapahtuman tietoja

source: Identifiers
fi: Tunnisteet

source: Date
fi: Päivämäärä

source: Place
fi: Paikka

source: Participants
fi: Tapahtumaan osalliset

source: Self
fi: Itse

source: List of families
fi: Perheluettelo

source: List of Families
fi: Perheluettelo

source: Displaying %(num)s distinct families
fi: Näytetään %(num)s perhettä

source: starting <tt>%(name)s</tt>
fi: alkaen <tt>%(name)s</tt>

source: from begin
fi: alusta

source: Go to
fi: Siirry

source: Father
fi: Mies

source: Starting letters of surname
fi: Sukunimen alku

source: Surname
fi: Sukunimi

source: Mother
fi: Vaimo

source: Top of page
fi: Sivun yläreunaan

source: first page
fi: Ensimmäiselle sivulle

source: no next page
fi: ei seuraavaa sivua

source: family
fi: perhe

source: Man
fi: Mies

source: Wife
fi: Vaimo

source: Children
fi: Lapset

source: Go to family page
fi: Siirry perhesivulle

source: Original ID
fi: Alkuperäinen tunniste

source: Key
fi: Avain

source: %(num)d child
fi: lapsi

source: hidden
fi: piilotettu

source: The last item found
fi: Viimeinen rivi

source: No one found with search keys starting "%(name)s"
fi: Ketään ei löytynyt hakutiedoilla "%(name)s" eteenpäin

source: Go to the first person
fi: Siirry listan ensimmäiseen henkilöön

source: Family details
fi: Perheen tiedot

source: Family
fi: Perhe

source: Relation
fi: Parisuhde

source: Family Events
fi: Perheen tapahtumat

source: of type
fi: Tyyppi

source: see details of place
fi: Katso paikan tiedot

source: Sources
fi: Lähteet

source: Page
fi: Sivu

source: in the repository
fi: arkistossa

source: Notes
fi: Lisätiedot

source: Origin from
fi: Alkuperäiset tiedot

source: User data
fi: Omia tietoja

source: Search for people
fi: Etsi henkilöitä

source: Search
fi: Haku

source: Person list by default name
fi: Oletusnimen mukainen henkilöluettelo

source: Persons
fi: Henkilöt

source: Families
fi: Perheet

source: Thumbnails
fi: Pienoiskuvat

source: Pictures
fi: Kuvat ja mediat

source: Get more info
fi: Katso lisätietoja

source: Log in to Isotammi
fi: Kirjaudu sisään

source: Change the data set shown
fi: Vaihda näytettävää aineistoa

source: Change
fi: vaihda

source: UUID key
fi: uuid-avain

source: number
fi: järjestysnumero kannassa

source: latest change time
fi: viimeisin muutoshetki

source: edited
fi: muokattu

source: See Person's Details
fi: katso henkilön tiedot

source: self
fi: itse

source: see details of person %(id)s
fi: Katso henkilön %(id)s tiedot

source: Anonymous
fi: nimetön

source: See Family Details
fi: Katso perhetiedot

source: Media data
fi: Median perustiedot

source: Picture
fi: Kuva

source: Thumbnail
fi: Pikkukuva

source: Size
fi: Koko

source: Show fullscreen
fi: Näytä suurena

source: References
fi: Viittauksia

source: see details of place %(id)s
fi: Katso paikan %(id)s tiedot

source: cropped
fi: rajattu

source: List of medias
fi: Mediatiedostot

source: List of Medias
fi: Mediatiedostot

source: Displaying %(num)s distinct medias
fi: Näytetään %(num)s eri kuvaa tai mediatiedostoa

source: Starting letters of media
fi: Nimikkeen alkukirjain

source: Title
fi: Otsikko

source: Media
fi: Mediat

source: User Batch
fi: Tarjokasaineisto

source: Go to media page
fi: Siirry mediasivulle

source: Photo
fi: kuva

source: No media found with search keys starting "%(name)s"
fi: Ei löytynyt mediaa, jonka nimike alkaa "%(name)s"

source: Go to the first media
fi: Siirry ensimmäiseen mediaan

source: Person's details
fi: Henkilön tiedot

source: Top
fi: Ylös

source: Sorting key
fi: Lajitteluavain

source: first name
fi: etunimi

source: patronymic
fi: patronyymi

source: surname
fi: sukunimi

source: Gender
fi: Sukupuoli

source: Private data
fi: Yksityinen tieto

source: Possible years
fi: Mahdolliset vuodet

source: confidential
fi: henkilötietoa ei julkaista

source: Age at death
fi: Ikä kuollessa

source: at least
fi: vähintään

source: about
fi: n.

source: years
fi: vuotta

source: Confidence of data
fi: Tietojen luotettavuus

source: See person note
fi: Ks. henkilön lisätiedot

source: See %(num)d person notes
fi: Ks. %(num)d lisätietoa

source: Events
fi: Tapahtumat

source: Event
fi: Tapahtuma

source: Place Notes
fi: Paikan lisätietoja

source: Parents' family
fi: Vanhempien perhe

source: Central person
fi: Keskushenkilö

source: Own families
fi: Omat perheet

source: As Parent in Family
fi: Perheessä vanhempana

source: Media files
fi: Mediatiedostot

source: Go to photo page
fi: kuvasivulle

source: crop
fi: rajaus

source: Person Notes
fi: Henkilön lisätietoja

source: Source references
fi: Lähdeviitteet

source: List of persons
fi: henkilöluettelo

source: Persons ordered by
fi: Henkilöt järjestyksessä

source: Persons carrying a Name
fi: Henkilöt, joilla on nimi

source: Displaying %(num)s person.
fi: Näytetään %(num)s henkilö.

source: If the person has many names, they may appear in the list under each name.
fi: Sama henkilö voi esiintyä listalla moneen kertaan, kullakin nimellään.

source: Note that family events are not included.
fi: Huomaa että perhetapahtumia ei tässä näytetä.

source: Sorted by %(order)s.
fi: Lajiteltuna %(order)s mukaan.

source: Change Order:
fi: Vaihda järjestys:

source: First Name
fi: etunimen

source: Patronymic or Matronymic
fi: patronyymin tai matronyymin

source: %(num)s person hidden because of privacy protection
fi: %(num)s henkilöä poistettu yksityisyyssuojan takia

source: Search takes place from beginning of selected name part, e.g. in Surname "Sib" coincides with the name "Sibbe".
fi: Haku tapahtuu annetun nimen alkuosalla, esim. "Sib" osuu nimeen "Sibbe".

source: Search word (beginning part)
fi: Hakusana (alkuosa)

source: Firstname
fi: etunimi

source: Patronymic
fi: patronyymi

source: Alphabetical Menu
fi: Aakkosvalikko

source: Owner
fi: Tutkija

source: Person
fi: Henkilö

source: Person's events
fi: Henkilön tapahtumat

source: Keywords
fi: hakusanat

source: Too recent for display to others!
fi: Liian tuore näytettäväksi muille!

source: No one found with search keys
fi: Ketään ei löytynyt hakutiedoilla

source: Displaying %(num)s distinct persons
fi: Näytetään %(num)s eri henkilöä

source: previous page
fi: edellinen sivu

source: next page
fi: seuraava sivu

source: Place events
fi: Paikan tapahtumat

source: Invalid coordinates
fi: Virheelliset koordinaatit

source: should be in decimal format
fi: pitäisi olla desimaalimuodossa

source: OpenStreetMap on a larger scale
fi: OpenstreetMap uudella sivulla

source: on Google Map
fi: Google-kartta uudella sivulla

source: Location
fi: Sijainti

source: Note
fi: Lisätiedot

source: Additional Information
fi: Lisätieto

source: No events
fi: Ei tapahtumia

source: The required place was not found.
fi: Pyydettyä paikkaa ei löydy!

source: Demo-data
fi: Esittelyaineisto

source: Places List
fi: Paikat

source: Displaying %(num)s distinct places
fi: Näytetään %(num)s paikkaa

source: Starting letters of place
fi: Paikan alkukirjain

source: Location, related places
fi: Paikka, liittyvät paikat

source: No references to place %(uuid)s
fi: Paikkaan %(uuid)s ei ole viittauksia

source: Go to location
fi: Siirry paikkaan

source: Events of a Source
fi: Lähteeseen liitetyt tapahtumat

source: Source References
fi: Lähdeviitteet

source: Source
fi: Lähde

source: Author
fi: Tekijä

source: Publishing info
fi: Julkaisutiedot

source: Abbreviation
fi: Lyhenne

source: Source References and Events
fi: Lähdeviitteet ja tapahtumat

source: confidence
fi: luottamustaso

source: see details of family
fi: Katso perheen tiedot

source: List of Sources
fi: Lähdeluettelo

source: This page contains a directory of %(num)s sources.
fi: Tällä sivulla näytetään %(num)s lähdettä.

source: Select series:
fi: Valitse aihe:

source: birth
fi: syntymä

source: babtism
fi: kaste

source: wedding
fi: vihkiminen

source: death
fi: kuolema

source: move
fi: muutto

source: Source, notes
fi: Lähde, lisätiedot

source: Media in the repository
fi: Muoto arkistossa

source: events, persons, etc., referred from
fi: viittauksia tapahtumista, henkilöistä jne.

source: unused
fi: ei käytetä

source: see details of source %(uniq_id)s (%(id)s)
fi: Katso lähteen %(uniq_id)s (%(id)s) tiedot

source: Repository Name
fi: Arkiston nimi

source: Your name:
fi: Nimesi:

source: Your email address:
fi: Sähköpostiosoitteesi:

source: Are you a member of the Genealogical Society of Finland?
fi: Oletko Suomen Sukututkimusseuran jäsen?

source: Yes
fi: Kyllä

source: No
fi: Ei

source: Don't know
fi: En tiedä

source: How many years have you been doing genealogical research?
fi: Montako vuotta olet harrastanut sukututkimusta?

source: What genealogy software are you mainly using?
fi: Mitä sukututkimusohjelmia pääasiallisesti käytät?

source: Which families/surnames are you mainly researching?
fi: Mitä sukuja pääasiassa tutkit?

source: Which places are you mainly researching?
fi: Mitä paikkakuntia pääasiallisesti tutkit?

source: Message:
fi: Viesti:

source: Send request
fi: Lähetä pyyntö

source: Join message sent
fi: Liittymisviesti lähetetty

source: Sending join message failed
fi: Liittymisviestin lähettäminen ei onnistunut

source: Update did not work1
fi: Päivitys ei onnistunut

source: Update did not work
fi: Päivitys ei onnistunut

source: Anonymous user
fi: Tunnistamaton käyttäjä

source: Exploring Isotammi Database
fi: Tutustu esittelyaineistoon

source: Select Material for Browsing
fi: Valitse selattava aineisto

source: Demo database
fi: Demo-aineistot

source: My candidate material
fi: Tarjokasaineistoni

source: The Browsed Material
fi: Selattava aineisto

source: You can view only approved and public material in Demo Database
fi: Voit katsella vain demoaineistoa

source: Continue
fi: Jatka

source: Isotammi User's Start Page
fi: Käyttäjän alkusivu

source: User's home page for Isotammi Services
fi: Isotammen aloitussivusi

source: First before importing your data to Isotammi database, it is best to check and fix your Gedcom file using the tools we provide.
fi: Ennenkuin tuot aineistosi Isotammeen, on parasta tutkia ja parannella sitä Gedcom-tarkistustyökalullamme.

source: Send your gedcom files and experiment various cleanup functions
fi: Lähetä oma gedcom-tiedostosi palvelimelle ja kokeile eri vakiointitoimia

source: My Gedcom files
fi: Gedcom-tiedostot

source: My candicate materials and files
fi: Gramps-tiedostot ja tarjokasaineistot

source: Send your Gramps xml file to Isotammi database and store it as a candidate material.
fi: Lähetä oma Gramps-tiedostosi palvelimelle ja talleta se Isotammen tarjokasaineistoksi.

source: Manage your candidate files and materials in database.
fi: Hallinnoi tarjokasaineistoja ja Gramps-tiedostoja

source: Browse and Manage
fi: Lisää ja muokkaa

source: Browse Isotammi Database
fi: Selaa Isotammi-aineistoa

source: View your own candidate material or all approved common data
fi: Tarkastele omia ehdokasaineistojasi tai yhdistettyjä Isotammi-aineistoja

source: The approved Isotammi data
fi: Hyväksytty Isotammi-aineisto

source: Admin Operations
fi: Ylläpitotoimet

source: Manage users, reference data sets and do database maintenance tasks
fi: Hallinnoi käyttäjiä ja referenssitietoja sekä hallinnoi tietokantaa.

source: Maintenance
fi: Ylläpito

source: Operations between user candidate materials and Isotammi database
fi: Tutkijan aineistojen ja Suomi-kannan keskeiset toiminnot

source: Tools and Links
fi: Työkaluja ja linkkejä

source: Study our supplementary stand-alone and Gramps utilities in our tools page
fi: Tutustu tarjoamiimme Grampsin ja muihin työkaluihin

source: Help page
fi: Ohjesivulle

source: Materials
fi: Aineistot

source: Approved data
fi: Hyväksytty Isotammi-aineisto

source: A variety of more technical listings and problem solving tools.
fi: Joukko teknisiä listauksia ja ongelmanselvitysvälineitä.

source: Explore the database
fi: Selaa tietokantaa

source: Join Isotammi
fi: Liity Isotammeen

source: Join us
fi: Liity mukaan

source: Enroll as a user on this page
fi: Hae käyttäjäksi tämän sivun lomakkeella

source: Approval
fi: Hyväksyminen

source: You are granted to register by Office
fi: Isotammen tuki tarkastaa jäsenyyden ja ilmoittaa sinulle

source: Create your user name and password
fi: Luo käyttäjätunnus ja salasana

source: Confirm
fi: Vahvistus

source: Press Confirm button in your email and log in
fi: Klikkaa Confirm sähköpostissasi; voila!

source: To join the Isotammi project we wish that you will provide some basic information below.
fi: Liittyäksesi Isotammi-projektin testikäyttäjäksi pyydämme antamaan joitakin perustietoja. Jos olet nämä tiedot antanut, voit siirtyä suoraan rekisteröitymiseen.

source: Please let us know at least your name and email address.
fi: Täytä ainakin nimesi ja sähköpostiosoitteesi.

source: You can also provide any comments or additional information in the message field.
fi: Alle voit halutessasi kirjoittaa lisätietoja.

source: Thank You!
fi: Kiitos!

source: Contact administrators
fi: Viesti tukeen

source: Message from Isotammi user
fi: Viesti Isotammen käyttäjältä

source: Close
fi: Sulje

source: User Settings
fi: Käyttäjän asetukset

source: My Profile Page
fi: Profiilini

source: Logout
fi: Kirjaudu ulos

source: Change language
fi: Vaihda kieltä

source: Active Roles
fi: Määritellyt roolit

source: Ask for a new role
fi: Pyydä lisäoikeuksia

source: Send a message to Isotammi office to acquire permission for new steps.
fi: Lähetä viesti Isotammen tukeen saadaksesi lisäoikeuksia.

source: Contact administrator
fi: Ota yhteys tukeen

source: Candidate Materials
fi: Tarjokasaineistot

source: The amount of some data nodes included in your candidate data batches.
fi: Tarjokasaineistosi tietojen lukumääriä

source: Approved %(n)s objects
fi: Hyväksyttynä %(n)s erilaista kohdetta

source: Upload or remove a file or candidate batch
fi: Lähetä tai poista Gramps-tiedosto tai tarjokasaineisto

source: You have no candidate data loaded in the database.
fi: Sinulla ei ole tarjokasaineistoja kannassa.

source: Upload another file
fi: Talleta aineistojasi tästä

source: Bytes
fi: merkkiä

source: You have no Gedcom files in the server.
fi: Palvelimella ei ole yhtään gedcom-tiedostoasi.

source: Start page
fi: Etusivu

source: Home
fi: Etusivulle

source: Instructions for this page
fi: Ohjeita tälle sivulle

source: Help
fi: Sivun ohje

source: Message to the administrator
fi: Pyyntö tai ilmoitus tukeen

source: User profile settings
fi: Käyttäjäprofiilin asetukset

source: My home page
fi: Käyttäjäprofiilini

source: Log in to this application
fi: Kirjaudu sovellukseen

source: Log in
fi: Kirjaudu sisään

source: Log out from this application
fi: Lopeta istunto

source: Thank You
fi: Kiitos!

source: Thank You for joining Isotammi
fi: Kiitos, että liityit Isotammen käyttäjiin

source: We are processing your request and will soon send you further instructions in email.
fi: Käsittelemme pyyntösi ja lähetämme pian lisäohjeita sähköpostilla.

source: Go to main page
fi: Etusivulle

source: Methods:
fi: Palvelut:

source: Users:
fi: Käyttäjät:

source: regexp(s) to match users
fi: käyttäjien rajaus (reg.expression)

source: How many:
fi: Lukumäärä:

source: How many at most?
fi: Maksimimäärä

source: Sort by count:
fi: Osumamäärän mukaisessa järjestyksessä

source: Sort by count or by text?
fi: Nimen tai määrän mukaan lajiteltuna?

source: Devel Stats
fi: Kehitystilasto

source: Development stats
fi: Sovelluskehityksen tilasto

source: Statistics about STK
fi: Isotammi-tilasto

source: App Stats
fi: Sovellustilastot

source: Upload statistics
fi: Lataustilasto

source: Msgs:
fi: Sanomat:

source: python regexp(s) to match messages
fi: Python säännöllinen lauseke sanomien hakuun

source: Users:
fi: Käyttäjät:

source: python regexp(s) to match start of username
fi: Python säännöllinen lauseke käyttäjätunnuksen alkuun

source: Logs:
fi: Lokit:

source: By count:
fi: Osumamäärän mukaan:

source: Confirm account
fi: Vahvista tili

source: Forgot password
fi: Unohditko salasanan

source: Reset of Password
fi: Salasanan elvyttäminen

source: A Forgotten Password
fi: Salasanan elvyttäminen

source: Ask for Password Recovery
fi: Pyydä uutta salasanaa

source: If you have forgotten your password, you can ask for a new one here. You will get the instructions by email.
fi: Jos salasanasi on unohtunut, voit pyytää salasanan elvytystä. Saat sähköpostissa linkin, jonka kautta pääset jatkamaan.

source: Other Options
fi: Muita vaihtoehtoja

source: Welcome to Isotammi
fi: Tervetuloa Isotammeen

source: Log in to Isotammi Service
fi: Kirjautuminen Isotammi-palveluun

source: Login with your credentials
fi: Kirjaudu tunnuksillasi

source: Can't login?
fi: Eikö kirjautuminen onnistu?

source: You must first ask for enrolling a user from administrator.
fi: Sinun on pyydettävä kutsu Isotammen tuesta.

source: Then you can register in and create your user id.
fi: Sitten voit rekisteröityä käyttäjäksi.

source: Enroll as a user
fi: Hae käyttäjäksi

source: Registration
fi: Rekisteröityminen

source: Fill in the User Information Form of Isotammi database Service
fi: Täytä käyttäjätietolomake Isotammeen

source: Register as an user of Isotammi Service
fi: Rekisteröidy Isotammen käyttäjäksi

source: It is possible to register only if you have got an invitation. You may ask for invitation on the page
fi: Voit rekisteröityä vain jos olet saanut kutsun. Voit ilmoittautua halukkaaksi sivulla

source: Note!
fi: Huomaa!

source: When you have sent this form, you must wait for mail from us and click the link "%(link)s" in the message you got. Then you can log in!
fi: Kun olet lähettänyt tämän lomakkeen, odota sähköpostia meiltä. Klikkaa siinä olevaa linkkiä "%(link)s". Näin pääset aloittamaan Isotammessa!

source: Other Operations
fi: Moita toimintoja

source: My User Properties
fi: Käyttäjätietoni

source: Define a username and password for you
fi: Valitse itsellesi käyttäjätunnus ja salasana
