Repository: Taapeli/stk-upload
Catalog: app/static/translations/*.po
Languages: fi

source: Verifying registration
fi: Rekisteröitymisen vahvistaminen

source: Ask for Validation Link
fi: Pyydä uusi vahvistuslinkki

source: Submit Validation Link
fi: Lähetä vahvistuslinkki

source: If you can't find the registeration confirmation mail message we have sent, you can ask for a new one.
fi: Jos lähettämämme rekisteröitymisen vahvistuslinkki ei toimi enää, voit pyytää uutta tässä.

source: Note List
fi: Huomautukset

source: Note Items
fi: Note-kohteet

source: Repositories
fi: Arkistot

source: Repository data
fi: Arkistotiedot (repository)

source: Material type
fi: Aineistotyypin

source: processing still missing
fi: käsittely puuttuu vielä

source: {} in Family {}/{}
fi: {} perheessä {} / {}

source: Mother: {}/{} p. {}
fi: Äiti: {} / {} s. {}

source: Father: {}/{} p. {}
fi: Isä: {} / {} s. {}

source: Child ({}): {}/{} * {}
fi: Lapsi ({}): {} / {} *{}

source: Wrong Search key
fi: Väärä hakuavain

source: Only the OID can retrieve
fi: Vain avaimella voi hakea

source: Person data
fi: Henkilön tiedot

source: Names
fi: Nimet

source: Link to Narrated Page
fi: Linkki henkilösivulle

source: People who has the surname
fi: Henkilöt, joilla on sukunimi

source: Click on the column header to sort column
fi: Klikkaa saraketta lajitellaksesi sen suhteen

source: List of persons with the same birth date
fi: Luettelo henkilöistä, joilla sama syntymäaika

source: Showing person pairs
fi: Näytetään henkilöparit

source: All/same Given name
fi: Kaikki/Sama etunimi

source: List of persons with the same date of death
fi: Luettelo henkilöistä, joilla sama kuolinaika

source: List of persons with the same name
fi: Luettelo henkilöistä, joilla sama nimi

source: All/Same Birth date
fi: KAIKKI/Sama syntymäaika

source: Families data
fi: Perheiden tiedot

source: Main person
fi: Keskushenkilö

source: unique id
fi: avain

source: sex
fi: sukupuoli

source: firstname
fi: etunimi

source: suffix
fi: jälkiosa

source: No person information
fi: Ei henkilötietoja

source: Spouse
fi: puoliso

source: No family information
fi: Ei perhetietoja

source: Picture cannot be found
fi: Kuvaa ei löydy

source: Narrative Page
fi: Henkilösivu

source: unique_id
fi: avain

source: private
fi: ei julkinen

source: link
fi: linkki

source: type
fi: tyyppi

source: date
fi: päiväys

source: place
fi: paikka

source: description
fi: kuvaus

source: link to source data
fi: linkki alkuperäiseen tietoon

source: citations
fi: lainaukset

source: No event information
fi: Ei tapahtumatietoja

source: URLs
fi: nettiosoitteet

source: priv
fi: ei julkinen

source: URL
fi: Verkko-osoite

source: No URL information
fi: Ei verkko-osoitetta

source: Identifier
fi: Tunniste

source: Sort name
fi: Lajitteluavain

source: Db handle
fi: Tietokanta-avain

source: Identifier < br/> Type < br/> Date </div>
fi: Tunniste<br />tyyppi<br />aika</div>

source: Source Details
fi: Lähteen tiedot

source: Identifier<br />Date<br />Page<br />Confidence
fi: Tunniste<br />Date<br />Page<br />Confidence

source: Baptism data
fi: Kasteen aikatieto

source: Number of families:
fi: Perheiden lukumäärä:

source: id of Father
fi: id

source: id of Mother
fi: id

source: No of Children
fi: Lapsia

source: Links of Children
fi: Lapset

source: No persons
fi: Ei ketään

source: uniq_id
fi: numero

source: src
fi: lähde

source: picture
fi: kuva

source: List of Persons
fi: Henkilöluettelo

source: Number of persons:
fi: Henkilömäärä:

source: Links
fi: Avaimet

source: Lifetime
fi: Elinaika

source: Event type
fi: Tapahtuman tyyppi

source: lived
fi: elänyt

source: Reference names from Database
fi: Referenssinimet kannasta

source: Included
fi: Mukana

source: name
fi: nimeä

source: Type ~ Ref. name
fi: tyyppi ~ ref.nimi

source: Name Source
fi: nimilähde

source: Showing sources
fi: Näytetään lähteet

source: stitle
fi: otsikko

source: sauthor
fi: tekijä

source: spubinfo
fi: julk.

source: All surnames
fi: Kaikki sukunimet

source: (No Name)
fi: (nimetön)

source: Data Views
fi: Taulukkonäkymiä

source: Technical views
fi: Teknisiä näkymiä

source: Data Views as tables
fi: Teknisiä näkymiä

source: Show people
fi: Näytä henkilöt

source: Show families
fi: Näytä perheet

source: List of surnames
fi: Luettelo sukunimistä

source: List of media files, called recordings
fi: Luettelo mediatiedostoista eli tallenteista

source: List of repositories
fi: Luettelo arkistoista

source: (on Repository page sources in Repository)
fi: (arkistosivulla arkiston lähteet)

source: List of sources (references on the source page)
fi: Luettelo lähteistä (lähdesivulla viittaukset)

source: Comments
fi: Huomautukset

source: Find possible doubles
fi: Etsi mahdollisia tuplahenkilöitä

source: Find people with the same name
fi: Etsi samannimiset henkilöt

source: Find people with the same birth date
fi: Etsi henkilöt, joilla sama syntymäaika

source: Find people with the same date of death
fi: Etsi henkilöt, joilla sama kuolinaika

source: Problem Solving Tools
fi: Ongelmanselvitysvälineitä

source: Persons without birth event
fi: Henkilöt ilman syntymätapahtumaa

source: Senior Citizens, Top twenty
fi: 20 vanhinta henkilöä

source: Events without place information
fi: Paikattomat tapahtumat

source: Unreferenced sources
fi: Viittauksettomat lähteet

source: Sources without a repository
fi: Lähteet ilman arkistoa

source: Unreferenced Events
fi: Viittauksettomat tapahtumat

source: Event list
fi: Tapahtumaluettelo

source: Showing events without source citation
fi: Näytetään tapahtumat joissa ei lähdelainausta

source: Showing events without places
fi: Näytetään tapahtumat joissa ei paikkatietoa

source: Showing persons without a birth event
fi: Näytetään henkilöt joilla ei syntymätapahtumaa

source: Showing oldest persons and their age
fi: Näytetään vanhimmat henkilöt ja heidän ikänsä

source: List of places
fi: Paikat-lista

source: Showing places
fi: Näytetään paikat

source: Source list
fi: Lähdeluettelo

source: Showing sources without source citations
fi: Näytetään lainauksettomat lähteet

source: Showing sources without a repository
fi: Näytetään lähteet ilman arkistoa

source: Estimated {} person lifetimes
fi: Arvioitu elinaika {} henkilölle

source: calculated
fi: laskettu

source: estimated
fi: arvioitu

source: {}till {}
fi: {}{} saakka

source: {}from {}
fi: {}{} alkaen

source: {}between {} … {}
fi: {}välillä {} … {}

source: {}about {}
fi: {}noin {}

source: Child
fi: lapsi

source: Son
fi: poika

source: Daughter
fi: tytär

source: sex not known
fi: tuntematon sukupuoli

source: male
fi: mies

source: female
fi: nainen

source: sex not applicable
fi: ei sukupuolta

source: The file is too large (max %1 MB)
fi: Liian suuri tiedosto (yli %1 Mb)

source: Server error
fi: Palvelinvirhe

source: File already exists
fi: Tiedosto on jo olemassa

source: Are you sure?
fi: Oletko varma?

source: Revert to %1
fi: Palauta %1

source: %1 renamed to %2
fi: %1: nimeksi vaihdettu %2

source: Errors:
fi: Virheitä:

source: List of Repositories
fi: Arkistot

source: Showing repositories
fi: Näytetään arkistot (repositories)

source: Confidence
fi: luottamustaso

source: Stitle
fi: Otsikko

source: Medium
fi: Keskiarvo

source: Rname
fi: Otsikko

source: Result of processing
fi: Käsittelyn tulos

source: Success of database processing
fi: Tietokantakäsittelyn onnistuminen

source: Users
fi: Käyttäjät

source: user id
fi: Käyttäjän ID tunnus

source: roles
fi: Roolit

source: Create Username
fi: Luo käyttäjätunnus

source: Create a new user or update the old one
fi: Luo uusi käyttäjä tai päivitä vanha

source: Isotammi Start Page
fi: Isotammi alkusivu

source: Welcome to Isotammi Services
fi: Tervetuloa Isotammeen

source: Learn about Isotammi
fi: Tutustu palveluumme

source: <i>Isotammi Database</i> is a system for co'operatively collect validated Finnish Genealogy data.
fi: <i>Isotammen</i> tarkoituksena on koota yhteistyössä suuri luotettavien sukutietojen kokoelma.

source: For more info see also documents -
fi: Lue lisää –

source: Why Isotammi database
fi: Mikä on Isotammi-järjestelmä?

source: See the process for your data
fi: Katso miten sukutietosi voidaan liittää Isotammen aineistoon

source: Gedcom data healing services
fi: Sukutietojen vakiointi Gedcom-ohjelmillamme

source: Look at demo data in Isotammi Database
fi: Selaa Isotammen demoaineistoa

source: Here you can see a restricted view on demo genealogical data.
fi: Tässä rajattu näkymä esimerkkiaineistoon.

source: Explore demo
fi: Selaa aineistoa

source: To see the full data, you can fill the registration form here
fi: Rekisteröitymällä näet täydelliset tiedot

source: As a member of <i>Suomen sukututkimusseura</i>, you can log in,
fi: <i>Suomen sukututkimusseuran</i> jäsenenä voit kirjatua sisään,

source: refine the structure of your own data and get full access to the demo database
fi: parantaa omien tietojesi rakennetta ja saada pääsyn koko demokantaan

source: Birth Name
fi: syntymänimi

source: Also Known As
fi: tunnettu myös

source: Married Name
fi: avionimi

source: Unknown type
fi: tuntematon tyyppi

source: Birth
fi: syntymä

source: Death
fi: kuolema

source: Occupation
fi: ammatti

source: Baptism
fi: kaste

source: Burial
fi: hautaus

source: Marriage
fi: avioliitto

source: Divorce
fi: avioero

source: Residence
fi: asuinpaikka

source: Cause Of Death
fi: Kuolinsyy

source: Moved out
fi: poismuutto

source: Moved to
fi: tulomuutto

source: Graduation
fi: valmistuminen

source: Degree
fi: oppiarvo

source: Ordination
fi: palkitseminen

source: Property
fi: omaisuus

source: Education
fi: koulutus

source: War
fi: sota

source: Confirmation
fi: ripille pääsy

source: First Communion
fi: ensimmäinen ehtoollinen

source: Military Service
fi: asepalvelus

source: Christening
fi: kristillinen kaste

source: Marriage Banns
fi: kuulutus avioliittoon

source: Retirement
fi: eläkkeelle siirtyminen

source: Nobility Title
fi: aatelointi

source: Engagement
fi: kihlautuminen

source: Immigration
fi: maahanmuutto

source: Holy Communion
fi: ehtoollinen

source: Primary
fi: pääosallisena

source: Kummi
fi: kummina

source: Perillinen
fi: perillisenä

source: kummi
fi: kummina

source: Clergy
fi: pappina

source: Osallinen
fi: osallisena

source: Ostaja
fi: ostajana

source: Perinnönjättäjä
fi: perinnönjättäjänä

source: Vihkijä
fi: vihkijänä

source: Pääosallinen
fi: pääosallisena

source: Edunsaaja
fi: edunsaajana

source: Myyjä
fi: myyjänä

source: Husband
fi: mies

source: as child
fi: lapsena

source: Unknown role
fi: määräämätön rooli

source: confidence 0/4
fi: erittäin matala

source: confidence 1/4
fi: alhainen (1/4)

source: confidence 2/4
fi: normaali (2/4)

source: confidence 3/4
fi: korkea (3/4)

source: confidence 4/4
fi: erittäin korkea (4/4)

source: See
fi: ks.

source: Citation
fi: viite

source: Event Note
fi: tapahtuma

source: Source Note
fi: lähde

source: Person Note
fi: henkilö

source: Place Note
fi: paikka

source: Name Note
fi: nimi

source: To Do
fi: työlistalla

source: Family Note
fi: perhe

source: Repository Note
fi: arkisto

source: Media Reference Note
fi: mediaviite

source: Media Note
fi: media

source: General
fi: yleistä

source: Html code
fi: html-koodi

source: Web Search
fi: Verkossa

source: Home Page
fi: Kotisivu

source: Album
fi: albumi

source: Archive
fi: arkisto

source: Collection
fi: kokoelma

source: Library
fi: kirjasto

source: Web site
fi: nettisivu

source: Document
fi: asiakirja

source: Book
fi: kirja

source: Electronic
fi: sähköinen

source: Newspaper
fi: lehti

source: Magazine
fi: aikakauslehti

source: Tombstone
fi: hautakivi

source: Manuscript
fi: käsikirjoitus

source: Unknown
fi: tuntematon

source: Vessel
fi: alus

source: Borough
fi: aluehallintoyksikkö

source: Building
fi: rakennus

source: City
fi: paikkakunta

source: Country
fi: maa

source: District
fi: lääni

source: Farm
fi: tila

source: Hamlet
fi: mökki

source: Cemetery
fi: hautausmaa

source: Mansion
fi: kartano

source: Fortress
fi: linnoitus

source: Locality
fi: kulmakunta

source: Organisation
fi: organisaatio

source: Parish
fi: srk

source: Region
fi: alue

source: State
fi: valtio

source: Town
fi: kaupunki

source: Village
fi: kylä

source: on vessel
fi: aluksella

source: in the borough of
fi: aluehallintoyksikössä

source: in the building of
fi: rakennuksessa

source: in the City
fi: kaupungissa

source: in the country of
fi: maassa

source: in the district of
fi: läänissä

source: in the farm of
fi: tilalla

source: in the hamlet of
fi: mökissä

source: in the mansion of
fi: kartanossa

source: in the fortress
fi: linnoituksessa

source: at locality of
fi: kulmakuntannalla

source: in the organisation of
fi: organisaatiossa

source: in the parish
fi: seurakunnassa

source: in the region
fi: alueella

source: Sn the state
fi: valtiossa

source: in the village of
fi: kylässä

source: in the parish of
fi: seurakunnassa

source: Married
fi: Avioliitossa

source: Unknown relation
fi: Tuntematon suhde

source: Merging people
fi: Henkilöiden yhdistäminen

source: People whose name begins with
fi: Henkilöt joiden nimi alkaa

source: Mark the central person (1st selection column) and the people to be merged (2nd column)
fi: Merkitse keskushenkilö (1. sarake) ja yhdistettävät henkilöt (2. sarake)

source: If necessary, pick up nearby reference names <i> (not already in use)
fi: Valitse referenssinimet tarpeen mukaan

source: Merge to selected Central Person
fi: Yhdistä keskushenkilöön

source: Relate Person
fi: Liitä henkilöön

source: person
fi: henkilö

source: Court, Signum
fi: Käräjät, Signum

source: Loaded file
fi: Luettu tiedosto

source: Would display statistics
fi: Näytettäisiin tilastoa

source: Repository Details
fi: Repositoryn tiedot

source: Repository
fi: Arkisto

source: URL href
fi: verkko-osoite

source: URL type
fi: verkko-osoitteen tyyppi

source: URL description
fi: verkko-osoitteen kuvaus

source: Identifier < br/> Title < br/> Medium
fi: Tunniste<br>otsikko<br>kuva

source: Selecting Reference Data
fi: Referenssitietojen valinta

source: Select the type of connection to be stored:
fi: Valitse talletettava yhteystyyppi:

source: --Select the reference connection--
fi: -- valitse referenssiyhteys --

source: Given name A is normalized as Given name B
fi: Etunimi A on normalisoitu etunimi B

source: Surname A is a normalized as Surname B
fi: Sukunimi A on normalisoitu sukunimi B

source: Patronymic name A refers to the Given name B
fi: Patronyyminen nimi A viittaa etunimeen B

source: Place name A is the normalized as Place name B
fi: Paikannimi A on normalisoitu paikannimi B

source: Occupation title A is normalized to title B
fi: Ammattinimike A on normalisoitu nimike B

source: Name A
fi: Nimi A

source: --Select a column--
fi: -- valitse sarake --

source: Given name_normalized
fi: Etunimi, vakioitu

source: PatroRef
fi: Viite patronyymissä olevaan etunimeen

source: Surname_normalized
fi: Sukunimi, vakioitu

source: Occupation_normalized
fi: Ammatti, vakioitu

source: Place_normalized
fi: Paikka_vakioitu

source: Comment
fi: Kommentti

source: Court
fi: Käräjät

source: Place of Court
fi: Käräjäpaikka

source: Start date
fi: Alkuaika

source: End date
fi: Loppuaika

source: Undefined language
fi: Määrittämätön kieli

source: Russian
fi: venäjä

source: Karelian
fi: karjala

source: Latin
fi: latina

source: Name B
fi: Nimi B

source: Save data in Selected columns as <br/> reference names
fi: Talleta valittujen sarakkeiden tiedot<br/>referenssiniminä

source: Accept
fi: Hyväksy

source: Failed to load
fi: Lataus epäonnistui

source: Invalid input file
fi: Virheellinen syöttötiedosto

source: No permission
fi: Ei oikeutta

source: Unable to load file
fi: Tiedoston lataaminen ei onnistu

source: Unable to load file, code =
fi: Tiedoston lataus ei onnistu, koodi=

source: Approved common data
fi: Hyväksytty Isotammi-aineisto

source: My candidate data
fi: Tarjokasaineistoni

source: My selected candidate batch
fi: Valittu tarjokasaineistoni

source: My own and approved common data
fi: Omat tarjokasaineistoni ja hyväksytty Isotammi-aineisto

source: My selected batch and approved common data
fi: Valittu tarjokasaineistoni ja hyväksytty Isotammi-aineisto
