Repository: Taapeli/stk-upload
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: sv

source: Study our supplementary stand-alone and Gramps utilities in our tools page
sv: Studera våra kompletterande fristående och Gramps-verktyg på vår verktygssida

source: Help page
sv: Hjälp sida

source: Join Isotammi
sv: Anslut Isotammi

source: To join the Isotammi project please provide some basic information below.
sv: För att ansluta Isotammi projektet önskar vi att du ger några grundläggande information nedan.

source: You can also provide any comments or additional information in the message field.
sv: Du kan också lämna kommentarer eller ytterligare information i meddelande fältet.

source: After sending this form you will still have to wait for a confirmation email from the Isotammi team before you can access the application.
sv: Efter att ha skickat detta formulär vänta på en bekräftelse e-post från Isotammi teamet innan du kan logga i programmet.

source: Thank You!
sv: Tack!

source: Contact administrators
sv: Kontakta administratörer

source: Message from Isotammi user
sv: Meddelande från Isotammi användare

source: Close
sv: Stäng

source: Profile Page
sv: Min profilsida

source: Logout
sv: Utloggning

source: Change language
sv: Byt språk

source: Ask for a new role
sv: Be om en ny roll

source: Send a message to Isotammi office to acquire permission for new steps.
sv: Skicka ett meddelande till Isotammi-kontoret för att få tillstånd för nya steg.

source: Contact administrator
sv: Kontakta administratör

source: Your Materials
sv: Mina material

source: See all your materials
sv: Listan över materialen

source: My Gedcom files
sv: Mina Gedcom filer

source: Bytes
sv: Bits

source: You have no Gedcom files in the server.
sv: Du har ingen Gedcom fil på servern.

source: Start page
sv: Start sida

source: Home
sv: Hem

source: Instructions for this page
sv: Instruktioner för denna sida

source: Help
sv: Hjälp

source: Message to the administrator
sv: Meddelande till administratören

source: User profile settings
sv: Inställningar för användar profil

source: My home page
sv: Min hemsida

source: Log in to this application
sv: Logga in denna applikation

source: Log in
sv: Logga in

source: Log out from this application
sv: Logga ut denna applikation

source: Processing steps of Isotammi material
sv: Steg för prosessing materialet

source: The file has been uploaded to server
sv: Filen har överförts till servern

source: Merged
sv: Förenad

source: Joined to common data
sv: Sammansmältad till den gemensamma datan

source: Thank You
sv: Tack

source: Thank You for joining Isotammi
sv: Tack för att du ansluter Isotammi

source: We are processing your request and will soon send you further instructions in email.
sv: Vi bearbetar din begäran och kommer snart att skicka dig ytterligare instruktioner i e-post.

source: Go to main page
sv: Gå till huvudsidan

source: Methods:
sv: Metoder:

source: date
sv: datum

source: Users:
sv: Användare:

source: daily
sv: dagligen

source: weekly
sv: veckoligt

source: monthly
sv: mämadsvis

source: regexp(s) to match messages/methods
sv: regexp(s) för att matcha meddelanden/metoder

source: Users separated by commas
sv: Anvädare separeras med kommas

source: How many:
sv: Hur många:

source: How many at most?
sv: Hur många som mest?

source: Sort by count:
sv: Sortera efter antal:

source: Sort by count or by text?
sv: Sortera efter antal eller efter text?

source: Devel Stats
sv: Devel Statistik

source: Development stats
sv: Devel Statistik

source: Origin from
sv: Data från

source: Statistics about STK
sv: Statistik om STK

source: App Stats
sv: App statistik

source: Upload statistics
sv: Ladda upp statistik

source: Msgs:
sv: Medd:

source: python regexp(s) to match messages
sv: python regexp(s) för att matcha meddelanden

source: Users:
sv: Användare:

source: python regexp(s) to match start of username
sv: python regexp(s) för att matcha start av användarnamn

source: Logs:
sv: Loggar:

source: shell glob to match log files in
sv: shell glob att matcha loggfiler i

source: By count:
sv: Efter antal:

source: Confirm account
sv: Bekräfta konto

source: Forgot password
sv: Glömt lösenordet

source: Reset of Password
sv: Nollställ lösenordet

source: A Forgotten Password
sv: Ett glömt lösen ord

source: Ask for Password Recovery
sv: Be om återställning av lösen ord

source: If you have forgotten your password, you can ask for a new one here. You will get the instructions by email.
sv: Om du har glömt ditt lösen ord dukan be om ett nytt här. Du kommer att få instruktionerna via e-post.

source: Other Options
sv: Andra alternativ

source: Welcome to Isotammi
sv: Välkommen till Isotammi

source: Log in to Isotammi Service
sv: Logga in på Isotammi Service

source: Login with your credentials
sv: Logga in med din identifieringsinformation

source: Can't login?
sv: Kan du inte logga in?

source: Registration
sv: Registrering

source: Fill in the User Information Form of Isotammi database Service
sv: Fyll i användar information form av Isotammi Databasen Service

source: Register as an user of Isotammi Service
sv: Registrera dig som användare av Isotammi Service

source: When you have sent this form, you must wait for mail from us and click the link "%(link)s" in the message you got. Then you can log in!
sv: När du har skickat detta formulär måste du vänta på e-post från oss och klicka på länken "%(link)s" i meddelandet du fick. Då kan du logga in!

source: Other Operations
sv: Andra operationer

source: My User Properties
sv: Mina användaregenskaper

source: Define a username and password for you
sv: Definiera ett användarnamn och lösenord för dig

source: Verifying registration
sv: Verifierar registreringen

source: Ask for Validation Link
sv: Fråga efter validerings länk

source: Submit Validation Link
sv: Sänd validitations länk

source: If you can't find the registration confirmation mail message we have sent, you can ask for a new one.
sv: Om du inte hittar det meddelande om bekräftelse på registreringen som vi har skickat kan du be om ett nytt.

source: Your password has been changed.
sv: Ditt lösenord har ändrats.

source: If you did not change your password,
sv: Om du inte ändrade ditt lösenord,

source: click here to reset it
sv: klicka här för att återställa det

source: Please confirm your email through the link below:
sv: Vänligen bekräfta din e-post via länken nedan:

source: Confirm my account
sv: Bekräfta mitt konto

source: Welcome %(email)s!
sv: Välkommen %(email)s!

source: You can log into your account through the link below:
sv: Du kan logga in på ditt konto via länken nedan:

source: Login now
sv: Logga in nu

source: Click here to reset your password
sv: Klicka här för att återställa ditt lösenord

source: Your password has been reset
sv: Ditt lösenord har återställts

source: You can confirm your email through the link below:
sv: Du kan bekräfta din epostaddress med att klicka länken:

source: Could not save a comment
sv: Commentarens sparningen misslyckats

source: The file is too large (max %1 MB)
sv: Filen är för stor (max %1 MB)

source: Server error
sv: Server fel

source: File already exists
sv: Filen finns redan

source: Are you sure?
sv: År du säker?

source: Revert to %1
sv: Återgå till %1

source: %1 renamed to %2
sv: %1 har döpts om till %2

source: Errors:
sv: Fel:

source: Identifier
sv: Identifierare

source: Confidence
sv: Confidens

source: Result of processing
sv: Resultat av bearbetning

source: Success of database processing
sv: Framgång av databasbehandling

source: Users
sv: Användare

source: user id
sv: användar id

source: name
sv: namn

source: email
sv: epost

source: roles
sv: roller

source: No data
sv: Inget data

source: Create Username
sv: Skapa användarnamn

source: Create a new user or update the old one
sv: Skapa ny användare eller uppdatera nuvarande

source: Isotammi Start Page
sv: Isotammi start sida

source: Welcome to Isotammi Service
sv: Välkommen till Isotammi Service

source: Learn about Isotammi
sv: Läs mer om Isotammi

source: <i>Isotammi Service</i> is a service for co-operatively collected and validated genealogical data.
sv: <i>Isotammi</i> är en tjänst för kooperativt insamlade och validerade genealogiska data.

source: For more info see also documents -
sv: För mer information se även dokument -

source: Why Isotammi database
sv: Varför Isotammi databasen

source: See the process for your data
sv: Se processen för din data

source: Gedcom data healing services
sv: Service för att förbättra Gedcom-data

source: Look at the demo data
sv: Titta på demodata

source: In this demo we have a genealogical tree which follows our quality rules and it contains the relatives of the Finnish national compositor Jean Sibelius.
sv: I denna demo har vi ett genealogiskt träd som följer våra kvalitetsregler och det innehåller släktingarna till den finska nationalskompositör Jean Sibelius.

source: Explore demo
sv: Utforska demo

source: If you have already registered, you can log in and refine the structure of your own data.
sv: Om du redan har registrerat dig kan du logga in och förfina strukturen på dina egna data.

source: As a member of <i>Genealogical Society of Finland</i> you will get more services.
sv: Som medlem i <i>Genealogiska Sällskapet i Finland</i> får du fler tjänster.

source: To see the full data, you can fill the registration form here
sv: För att se hela data kan du fylla i anmälningsblanketten här

source: Merging people
sv: Sammanslagning av personer

source: People whose name begins with
sv: Personer vars namn börjar med

source: Mark the central person (1st selection column) and the people to be merged (2nd column)
sv: Markera den centrala personen (första kolumnen att väljä på) och de personer som ska slås samman (andra kolumnen)

source: If necessary, pick up nearby reference names <i> (not already in use)
sv: Om det behövs, plocka upp närliggande referens namn <i> (inte ännu användbar)

source: Merge to selected Central Person
sv: Slå ihop till vald central person

source: Relate Person
sv: Relatera person

source: Court, Signum
sv: Domstol, signum

source: Loaded file
sv: Laddad fil

source: Would display statistics
sv: Skulle visa statik

source: List of Repositories
sv: Arkiv lista

source: Showing repositories
sv: Visar arkiv

source: Reference names from Database
sv: Referensnamnen från databasen

source: Selecting Reference Data
sv: Väljer referens Data

source: Select the type of connection to be stored:
sv: Välj kopplingstyp att sparas:

source: --Select the reference connection--
sv: --Välj referens koppling--

source: Given name A is normalized as Given name B
sv: Förnamn A är normaliserat som förnamn B

source: Surname A is a normalized as Surname B
sv: Efternamn A är normaliserat till efternamn B

source: Patronymic name A refers to the Given name B
sv: Patronymnamn A refererar till förnamn B

source: Place name A is the normalized as Place name B
sv: Platsnamn A är normaliserat till Platsnamn B

source: Occupation title A is normalized to title B
sv: Yrkestitel A är normaliserad till titel B

source: Name A
sv: Namn A

source: --Select a column--
sv: --Välj kolumn--

source: Given name_normalized
sv: Förnamn_normaliserat

source: Surname_normalized
sv: Efternamn_normaliserat

source: Occupation
sv: Yrke

source: Occupation_normalized
sv: Yrke_normaliserat

source: Place_normalized
sv: Plats_normaliserad

source: Comment
sv: Kommentar

source: Court
sv: Domstol

source: Place of Court
sv: Domstols plats

source: Start date
sv: Startdatum

source: End date
sv: Slutdatum

source: Undefined language
sv: Odefinerat språk

source: Russian
sv: Ryska

source: Karelian
sv: Kareliska

source: Name B
sv: Namn B

source: Save data in Selected columns as <br/> reference names
sv: Spara data i vald kolumn som <br> referens namn

source: Accept
sv: Godkänn

source: URL description
sv: URL beskrivning

source: Identifier < br/> Title < br/> Medium
sv: Identifierare < br/> Tittel < br/> Medium

source: Data stored
sv: Data sparat

source: Store to Database
sv: Spara till databasen

source: Unexpected error
sv: Internt fel

source: Failed to load
sv: Det gick inte att ladda

source: Invalid input file
sv: Ogiltig fil

source: No permission
sv: Inget tillgång

source: Unable to load file
sv: Kan ej ladda filen

source: Unable to load file, code =
sv: Kan ej ladda filen, kod =

source: Send for auditing
sv: Sänd för granskning

source: Withdraw auditing
sv: Återkalla granskningen

source: Download the Gramps file
sv: Ladda ner Gramps-filen

source: Julian
sv: Julianisk

source: Hebrew
sv: Hebreisk

source: descr_admin
sv: admistrator förvaltar applikationen

source: descr_audit
sv: auditor inspekterar och accepterar material

source: descr_gedcom
sv: användare med rättigheter till gedcom-tools

source: descr_guest
sv: anonym användare kan ganska bara demoträdet

source: descr_master
sv: databasförvaltare med inga rättigheter till applikationen

source: descr_member
sv: medlem i Genealogiska Samfundet i Finland

source: descr_research
sv: släktforskare som laddar sitt släktträ och kan önska dess granskning

source: descr_to_be_approved
sv: släktforskare väntande godkännandet

source: Noble Name
sv: Ädelnamn

source: Also Known As
sv: Även känd som

source: Birth Name
sv: Födelsenamn

source: Married Name
sv: Gift namn

source: Taken Name
sv: Tagen namn

source: Soldier Name
sv: Soldatnamn

source: Artist Name
sv: Konstnärnamn

source: Changed Name
sv: Bytt namn

source: Unknown type
sv: Okänd typ

source: Grant Title
sv: Titel

source: Cause Of Death
sv: Dödsorsak

source: Census
sv: Folkräkning

source: Christening
sv: Dop

source: Confirmation
sv: Bekräftelse

source: Degree
sv: Grad

source: Divorce
sv: Skillnad

source: Education
sv: Utbildning

source: Holy Communion
sv: Nattvarden

source: Elected
sv: Val

source: Engagement
sv: Förlovning

source: First Communion
sv: Första Nattvard

source: Graduation
sv: Examen

source: Immigration
sv: Invandring

source: Lawsuit
sv: Rättegång

source: Public Duty
sv: Förtroendeuppdrag

source: Moved out
sv: Flyttat ut

source: Marriage Banns
sv: Lysning

source: Marriage
sv: Äktenskap

source: Medical Information
sv: Medicinsk information

source: Military Service
sv: Militär tjänst

source: Nobility Title
sv: Adels titel

source: Ordination
sv: Prästvigning

source: Accident
sv: Olycka

source: Estate Inventory
sv: Bouppteckning

source: Property
sv: Egenskap

source: Residence
sv: Hemtvist

source: Retirement
sv: Pension

source: War
sv: Krig

source: Official House
sv: Tjänsthus

source: Social Activities
sv: Samhällsaktiviteter

source: Name Change
sv: Namnändring

source: Moved to
sv: Flyttad in

source: as a child
sv: som barn

source: as spouse
sv: som make/maka

source: Foster-child
sv: Fosterbarn

source: Clergy
sv: Präster

source: Beneficiary
sv: Förmånstagare

source: Plaintiff
sv: Bärande

source: Concerned
sv: Mäl

source: Wittness
sv: Fadder

source: Husband
sv: Make

source: Myyjä
sv: Säljare

source: Teacher
sv: Lärare

source: Osallinen
sv: Deltagare

source: Buyer
sv: Köpare

source: Spouse
sv: Make/Maka

source: Heir
sv: Arvtagare

source: Testator
sv: Arvlåtare

source: Primary
sv: Primär

source: Pääosallinen
sv: Primär

source: Ceremonial
sv: Förräddare

source: Officiant
sv: Präst

source: Defendant
sv: Svarande

source: Unknown
sv: Okänd

source: confidence 0/4
sv: förtroende 0/4

source: confidence 1/4
sv: förtroende 1/4

source: confidence 2/4
sv: förtroende 2/4

source: confidence 3/4
sv: förtroende 3/4

source: confidence 4/4
sv: förtroende 4/4

source: Alternative names
sv: Alternativa namn

source: Event Note
sv: Händelse upplysning

source: Family Note
sv: Familj upplysning

source: Html code
sv: HTML-kod

source: See
sv: Se

source: Media Note
sv: Media upplysning

source: Media Reference Note
sv: Media referens upplysning

source: Name Note
sv: Namn upplysning

source: Person Note
sv: Person upplysning

source: Place Note
sv: Plats noteting

source: Repository Note
sv: Arkiv upplysning

source: Source Note
sv: Källa upplysning

source: To Do
sv: Att utföra

source: Transcript
sv: Textversion

source: Home Page
sv: Hemsidan

source: Web Search
sv: Web sökning

source: Archive
sv: Arkiv

source: Church
sv: Kyrka

source: Collection
sv: Kollektion

source: Library
sv: Bibliotek

source: Web site
sv: Webbplats

source: Document
sv: Dokument

source: Book
sv: Bok

source: Electronic
sv: Elektronisk

source: Magazine
sv: Tidning

source: Manuscript
sv: Manuskript

source: Newspaper
sv: Tidning

source: Tombstone
sv: Gravsten

source: Vessel
sv: Fartyg

source: Borough
sv: Stadsdel

source: Building
sv: Byggnad

source: City
sv: Stad

source: Country
sv: Land

source: Department
sv: Avdelning

source: District
sv: Distrikt

source: Farm
sv: Gård

source: Hamlet
sv: By

source: Burial Site
sv: Begravningsplats

source: Cemetery
sv: Kyrkogård

source: Chapel Parish
sv: Kappelförsamling

source: Mansion
sv: Herrgård

source: Denomination
sv: Samfund

source: Street Address
sv: Gatuadress

source: Block
sv: Kvarter

source: Kuntakeskus
sv: Kommun centrum

source: Governorate
sv: Guvernement

source: Institute
sv: Anläggning

source: Fortress
sv: Fästning

source: Locality
sv: Lokalitet

source: Natural Place
sv: Naturplats

source: Municipality
sv: Kommun

source: Neighborhood
sv: Område

source: Learning Institution
sv: Läroanstalt

source: Organization
sv: Organisation

source: Parish
sv: Församling

source: Province
sv: Provins

source: Hospital
sv: Sjukhus

source: State
sv: Delstat

source: Street
sv: Gata

source: Seat Farm
sv: Gård

source: Tontti
sv: Tomt

source: Torppa
sv: Torp

source: Town
sv: Stad

source: Village
sv: By

source: Company
sv: Företag

source: in the region
sv: i regionen

source: on vessel
sv: på fartyg

source: in the borough of
sv: i stadsdelen

source: in the building of
sv: i byggnaden

source: in the church
sv: i kyrkan

source: in the City
sv: i staden

source: in the country of
sv: i landet

source: in the department of
sv: i departmentet

source: in the district of
sv: i diskriten

source: in the farm of
sv: på gården

source: in the hamlet of
sv: i liten by

source: in a burial site of
sv: i begravningsplatsen

source: in the cemetery
sv: i kyrkogården

source: in chapel parish
sv: i kappelförsamling

source: in the mansion of
sv: i herrgården

source: in the denomination of
sv: i samfundet av

source: at street address
sv: på katuadressen

source: in the block
sv: i kvarteren

source: Kuntakeskuksessa
sv: I kommun centrum

source: in the governorate
sv: i guvernörsatet

source: in the institute
sv: i institutet

source: in the fortress
sv: i fästningen

source: at locality of
sv: på orten

source: in a natural place of
sv: i naturlig platsen

source: in the municipality of
sv: i kommunen

source: in the neighborhood of
sv: i området av

source: in the learning lnstitution
sv: i läroanstalten

source: in the organization of
sv: i organisationen

source: in the parish
sv: i församlingen

source: int the province of
sv: i provinsen

source: at the hospital
sv: i sjukhuset

source: in the parish of
sv: i församlingen

source: in the state
sv: i landet

source: on the street of
sv: vid gatan

source: in seat farm
sv: i säteri

source: in the farm
sv: på landgården

source: tontilla
sv: på tomten

source: in the town
sv: i staden

source: in the village of
sv: i byn

source: at the company
sv: i företaget

source: in a place of unknown type
sv: i oklassificerad platsen

source: Married
sv: Gift

source: Unknown relation
sv: Okänd relation

source: Family Tree
sv: Släktträd

source: Place Data
sv: Platsdata

source: Hiski Tree
sv: Hiski träd

source: Loading
sv: Laddar

source: Load Failed
sv: Laddning misslyckats

source: Root
sv: Material
