Repository: Taapeli/stk-upload
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: sv

source: Transformations
sv: Transformationer

source: Versions
sv: Versioner

source: Delete old versions
sv: Radera gamla versioner

source: Compare versions
sv: Jämför versioner

source: No previous versions
sv: Inga föregående versioner

source: Transformation history
sv: Thistorikrmation historik

source: GEDCOM comparison
sv: Gedcom jämförelse

source: Results
sv: Resultat

source: Perform transformation
sv: Utför transformation

source: Transformation results
sv: Transformations resultat

source: Old version is saved as
sv: Gamla versionen sparad som

source: Revert to old version
sv: Återgå till gamla versionen

source: Not saved yet
sv: Ej sparad

source: Save result
sv: Spara resultatet

source: Select your file for processing
sv: Välj din fil för bearbetning

source: Upload a new GEDCOM file
sv: Ladda upp ny Gedcom fil

source: Return main page
sv: Tillbaka till huvud sidan

source: transformation options
sv: transformations alternativ

source: Setting
sv: Inställning

source: Value
sv: Värde

source: Add
sv: Lägg till

source: Default
sv: Förval

source: check all
sv: kontrollera alla

source: Citations in notes
sv: Hänvisningar i noter

source: Correct some invalid date formats
sv: Korrigera vissa ogiltiga datum format

source: Display invalid dates
sv: Visa ogiltiga datum

source: Change 31.12.1999 to 31 DEC 1999
sv: Förändring 31.12.1999 DEC 1999

source: Change 1999-12-31 to 31 DEC 1999
sv: Förändring 1999-12-31 till 31 DEC 1999

source: Change 1999-12 to DEC 1999
sv: Förändring 1999-12 till DEC 1999

source: Change [00.]12.1999 to DEC 1999
sv: Ändra [00.]12,1999 till DEC 1999

source: Change 00 DEC 1999 to DEC 1999
sv: Förändring 00 DEC 1999 till DEC 1999

source: Change 1950-[19]59 to FROM 1950 TO 1959
sv: Förändring 1950-[19]59 till från 1950 till 1959

source: Change 1950-/>1950 to FROM/AFT 1950
sv: Förändring 1950-/> 1950 till FROM/AFT 1950

source: Change -1950/<1950 to TO/BEF 1950
sv: Förändring-1950/< 1950 till TO/BEF 1950

source: Invalid dates:
sv: Ogiltigt datum:

source: Baptisms
sv: Dop

source: Marriages
sv: Äktenskap

source: Splitting of data in PLAC of MARR
sv: Delning av data i PLAC av MARR

source: Personal names
sv: Personnamn

source: Mark missing name parts as "N"
sv: Markera fattande namn delar som "N"

source: Recognize_patronymes
sv: Känn igen_patronym

source: Call names and aliases
sv: Anropa nam och alias

source: Create surname history from multiple names
sv: Skapa efternamnshistorik från flera namn

source: Tries to recognize place names and order them correctly
sv: Försöker känna igen plats namnen och sortera dom korrekt

source: Display all unique places
sv: Visa alla unika platser

source: Reverse the order of places
sv: Omvänd sortering av platser

source: Replace spaces with commas
sv: Ersätt mellanslag med komma

source: Ignore lowercase words
sv: Ignorera ord med små bokstäver

source: Ignore numeric words
sv: Ignorera numeriska ord

source: Ignore words shorter that minlen
sv: Ignorera ord kortare än minimum längd

source: Try to discover correct order...
sv: Försök att hitta rätt ordning ...

source: Try to combine certain names...
sv: Försöker kombinera vissa namn...

source: Add this name at the end
sv: Lägg till detta namn i slutet

source: Bypass foreign countries
sv: Ignorera främmande länder

source: Display unique changed places
sv: Visa unika ändrade platser

source: Display unchanged places
sv: Visa oändrade platser

source: Display ignored places
sv: Visa ignorerade platser

source: Only process places containing this string
sv: Bearbeta endast platser som innehåller denna sträng

source: Replace changed PLAC tags with PLAC-X
sv: Ersätt ändrad PLAC tag med PLAC-X

source: Replace all matching PLAC tags with PLAC-X
sv: Ersätt alla matchande PLAC-Taggar med PLAC-X

source: Internal error
sv: Internt fel

source: All unique place names:
sv: Alla unika plats namn:

source: Count of all places:
sv: Antal platser:

source: Count of unique places:
sv: Summering av unika platser:

source: Place names changed:
sv: Platsnamn ändrats:

source: Old name
sv: Gammalt namn

source: New name
sv: Nytt namn

source: Place names not changed:
sv: Oändrade plats namn:

source: ignored:
sv: ignorerade:

source: Suku2004
sv: Suku 2004-programvara

source: Fixes problems in Sukuohjelmisto 2004 Gedcoms
sv: Fixar problem i Sukuohjelmisto 2004 Gedcom

source: Change custom tags to EVENs
sv: Ändra anpassade taggar till EVEN

source: Change _PHOTO tags to OBJEs
sv: Ändra _PHOTO tagg till OBJE

source: Change MARR to MARB if TYPE=Kuulutus
sv: Ändra MARR till MARB om TYPE=Kuulutus

source: Remove empty CONT lines under SOUR
sv: Radera tomma CONT rader under SOUR

source: Combine PLAC and ADDR
sv: Kombinera PLAC och ADDR

source: Sukujutut
sv: Sukujutut-programvara

source: Sukujutut transformations
sv: Sukujutut transformationer

source: Remove invalid DATE tags
sv: Radera felaktiga DATE taggar

source: Remove empty NOTE tags
sv: Radera tomma NOTE taggar

source: Remove DATE AVOLIITTO tags
sv: Radera DATE AVOLIITTO taggar

source: Remove invalid DATEs for DIV tags
sv: Radera felaktig DATE i DIV taggar

source: Remove empty GIVN and SURN tags
sv: Radera tomma GIVN och SURN taggar

source: Remove duplicate SOUR lines under NAME
sv: Radera duplikata SOUR rader under NAME

source: Remove REFN tags
sv: Radera REFN taggar

source: Remove STAT tags
sv: Radera STAT taggar

source: Move level 3 NOTEs to level 2 to save them
sv: Flytta nivå 3 NOTE's till nivå 2 för att sparas

source: Insert ADR1 tags under ADDR
sv: Lägg till ADR1 tag under ADDR

source: Change PLAC tags to NOTEs under certain events
sv: Ändra PLAC taggar till NOTE taggar vid vissa händelser

source: Change event types "Kaksonen" and "Kolmonen" to NOTEs
sv: Ändra händelse typ "Kaksonen" och "Kolmonen" till NOTE taggar

source: Remove trailing and multiple consecutive spaces in person and place names
sv: Tag bort radsluts mellanslag samt konsekutiva mellanslag i person och plats namn

source: Change EMIG to RESI
sv: Ändra EMIG till RESI

source: Move an event NOTE to citation PAGE
sv: Flytta en händelse anteckning till citeringssida

source: Move a SOUR under NOTE to upper level
sv: Uppgradera SOUR under upplysning

source: Unmark
sv: Avmarkera

source: Restores marked tags: <tag>-X -> <tag>
sv: Återställ markerad tag's: <tag>-X -> <tag>

source: The batch %(id)s upload has started in background.
sv: Materialet %(id)s upload has started in background.

source: You can follow the process below, but you can also leave or do something else.
sv: Du kan iakta processen undan eller gå och syssla med något annat.

source: Come back later to see the results.
sv: Återvänd för resultater

source: Failed to create a new batch -
sv: Det gick inte att bilda det nya materialet –

source: The file "%(n)s" does not exist
sv: Filen "%(n)s" finns inte

source: The log file for "%(n)s" does not exist any more
sv: Det finns inte log fil för material "%(n)s"

source: Batch not found
sv: Materialet finns inte

source: Could not delete Batch id %(batch_id)s
sv: Det gick inte att ta bort material "%(batch_id)s"

source: Batch %(batch_id)s has been deleted, %(n)s nodes
sv: Material %(batch_id)s har tagits bort, %(n)s noder

source: Failed to retrieve commands
sv: Det gick inte att hämta kommandon

source: ERROR: Update did not succeed:
sv: FEL: Uppdateringen fungerade inte:

source: Updated
sv: Uppdaterad

source: Scripting tool is not enabled
sv: Scripting tool finns inte

source: Gramps to Neo5j analyze
sv: Gramps till Neo4j analys

source: Analyze of the Gramps XML
sv: Analys av Gramps-XML

source: Objects ...
sv: Objekt...

source: referring
sv: hänvisande

source: Batch Details
sv: Materialdetaljer

source: wait...
sv: vänta ...

source: Material Details
sv: Materialdetaljer

source: General
sv: Allmänt

source: Changed
sv: Förendrats

source: Save
sv: Spara

source: Object Statistics
sv: Object typ statistik

source: Source citations
sv: Antal citeringar

source: Event Statistics
sv: Statistik över händerser

source: Nonstandard types
sv: Icke definerade typer

source: Category
sv: Kategori

source: Refresh nonstandard types
sv: Uppdatera icke definerade typer

source: Gramps analyze
sv: Analys av Gramps filen

source: Gramps Verify Tool
sv: Verifiera med Gramps verktyg

source: Download checked file
sv: Ladda ner granskad filen

source: Gramps to Neo5j log
sv: Gramps -> Neo4j logg

source: Log of storing Gramps XML into database
sv: Logg över spadare Gramps XML till databasen

source: Time / sec
sv: Tid / sek

source: Batch ID
sv: Material id

source: Scope
sv: Omfång

source: Event
sv: Händelse

source: Place
sv: Plats

source: Citation
sv: Hänvisning

source: Source
sv: Källa

source: Repository
sv: Arkiv

source: Note
sv: Övrig upplysning

source: Initial statements
sv: Inledande satser

source: Where
sv: Vart

source: Statements to execute for each object
sv: Satser att köras på varje objekt

source: Expressions to display
sv: Expression att visas

source: Execute
sv: Kör

source: Manage Materials
sv: Förvalta dina material

source: The file is too large (max %(max)s MB)
sv: Filen är för stor (max %1 MB)

source: Are you sure you want to delete the XML file?
sv: Vill du avlägsna XML filen?

source: Send a new Gramps file
sv: Sänd ny Gramps fil

source: Send to database
sv: Spara till databas

source: Select Gramps XML File (*.gramps etc) for converting to your candidate material
sv: Välj Gramps XML File (*.gramps eller *.gpkg) för konvertering till kandidat material

source: Person count
sv: Personer

source: Details and operations
sv: Statistiken och åtgärder

source: Merge sources
sv: Slå samman källor

source: Merge Sources
sv: Fusionera källor

source: Data read failed.
sv: Dataläsningen misslyckades.

source: references
sv: antydningar

source: inner places
sv: ingående platser

source: type changed
sv: typen has förendrats

source: type change FAILED
sv: typ förendring MISSLYCKATS

source: No event found
sv: Inga händelser hittades

source: Self
sv: Själv

source: No families
sv: Inga familjer

source: No objects found
sv: Ingenting funnits

source: No previous comments
sv: Inga kommentarer

source: List of Discussion Topics
sv: Lista av diskussion ämnen

source: Discussions
sv: Diskussioner

source: Displaying %(num)s distinct topics
sv: Visning av %(num)s distinkta ämnen

source: Author
sv: Författare

source: Concerned, Topic
sv: Tema

source: Replies
sv: Svaren

source: For auditor only
sv: Bara for granskaren

source: Go to comment page
sv: Gå till kommentsidan

source: Go to commented page
sv: Gå till pekande sidan

source: Unknown object
sv: Okänd typ

source: The last item found
sv: Den sista rad

source: No comment found starting from "%(name)s"
sv: Det hittades ingen kommentar som startar från %(name)s

source: first page
sv: första sidan

source: Go to the first comment
sv: Gå till den första kommentaren

source: No comments found
sv: Inga kommentarer hittades

source: Statistics for Material %(id)s
sv: Statistik över materialet %(id)s

source: Converting the Gramps file to the database
sv: Gramps-filen omvandlas till databasen

source: Storing
sv: Laddas

source: The data is stored as candidate material
sv: Lagrad som forskares material

source: Candidate
sv: Kandidat

source: Waiting for audition
sv: Väntar på granskningen

source: Audit Requested
sv: Granskning önskad

source: In audition
sv: Granskningen på gång

source: Auditing
sv: Granskas

source: Audit done
sv: Granskning färdig

source: Accepted
sv: Godkänt

source: Returned to researcher with comments
sv: Avfärdad till forskaren med kommentarer

source: Rejected
sv: Avfärdat

source: Auditor activities:
sv: Granskningar:

source: audits
sv: granskar

source: has audited
sv: har granskat

source: Statistics for Common Materials
sv: Statistik om förenad %(id)s

source: Materials of type
sv: Materialet av typ

source: Date
sv: Datum

source: Event details
sv: Händelse detaljer

source: Identifiers
sv: Identifierare

source: Participants
sv: Deltagare

source: Role
sv: Roll

source: List of families
sv: Lista över familjer

source: List of Families
sv: Lista över familjer

source: Displaying %(num)s distinct families
sv: Visar %(num)s distinkta familjer

source: from begin
sv: från start

source: starting <tt>%(name)s</tt>
sv: altifrån <tt>%(name)s</tt>

source: ordered by man's name
sv: sorterad enligt makes namn

source: ordered by wife's name
sv: sorterad enligt makas namn

source: Go to
sv: Gå till

source: Father
sv: Fader

source: Starting letters of surname
sv: Startbokstäver av efternamn

source: Surname
sv: Efternamn

source: Mother
sv: Moder

source: Top of page
sv: Överst på sidan

source: Alphabetical Menu
sv: Alfabetisk meny

source: Go to family page
sv: Gå till familje sidan

source: %(num)d child
sv: %(num)d barn

source: one hidden
sv: en dolda

source: No family found with search keys starting "%(name)s"
sv: Ingen familj hittades med söknycklar som startade %(name)s"

source: Go to the first person
sv: Gå till första personen

source: Family details
sv: Familj detaljer

source: Family Events
sv: Familje händelser

source: Page
sv: Sida

source: in the repository
sv: i arkivet

source: Search for people
sv: Sök personer

source: Search
sv: Sök

source: Person list by default name
sv: Person lista i standard namn order

source: Persons
sv: Personer

source: Thumbnails
sv: Miniatyrer

source: Pictures
sv: Bilder

source: Material details and actions
sv: Materialstatistik ock åtgärder

source: Material details
sv: Materialdetaljer

source: Get more info
sv: Få mer information

source: Log in to Isotammi
sv: Logga in på Isotammi

source: previous page
sv: föregående sida

source: no next page
sv: följande sida finns ej

source: next page starting
sv: nästa sida startas

source: latest change time and contributor
sv: sist förändringen och original bidragsgivare

source: edited
sv: redigerad

source: origin from
sv: bidragsgivare

source: , material
sv: , materialet

source: User data
sv: Anvädardata

source: , origin from material batch %(root)s
sv: , från materialet %(root)s

source: See Person's Details
sv: Se personens detaljer

source: self
sv: själv

source: Anonymous
sv: Anonym

source: born
sv: f.

source: died
sv: d.

source: Copy to clipboard
sv: Kopiera till clipboard

source: Media data
sv: Mediainformation

source: Picture
sv: Bilden

source: Size
sv: Storlek

source: Show fullscreen
sv: Visa fullt utslagen

source: References
sv: Referenser

source: Place %(gid)s '%(id)s'
sv: Plats %(gid)s '%(id)s'

source: Event %(gid)s '%(id)s'
sv: Händelse %(gid)s '%(id)s'

source: Family %(gid)s '%(id)s'
sv: Familj %(gid)s '%(id)s'

source: cropped
sv: beskuren

source: List of medias
sv: Lista över media

source: List of Medias
sv: Lista över media

source: Displaying %(num)s distinct medias
sv: Visas av %(num)s medier

source: First letters of media
sv: Startbokstav av media

source: Title
sv: Titel

source: User Batch
sv: Filen från forskaren

source: Go to media page
sv: Gå till mediasidan

source: Photo
sv: Foto

source: No medias found
sv: Det finns inga medier

source: Go to the first media
sv: Gå till det första mediet

source: Most common names
sv: Vanligaste namnen

source: No person names
sv: Inga personnamn

source: No places
sv: Inga platser

source: No results
sv: Inga resultat

source: Person's details
sv: Person detaljer

source: Top
sv: Toppen

source: Sorting key
sv: Sorterings nyckel

source: order by dragging
sv: ordna genom att dra

source: first name
sv: förnamn

source: patronymic
sv: patronym

source: surname
sv: efternamn

source: dates
sv: datum

source: Gender
sv: Kön

source: Private data
sv: Privat data

source: Possible years
sv: Möjlika åren

source: confidential
sv: confidentiell

source: Age at death
sv: Ålder vid död

source: at least
sv: minst

source: about
sv: runt

source: years
sv: år

source: Age this year
sv: Ålder i år

source: Confidence of data
sv: Konfidens av data

source: See person note
sv: Se personanteckning

source: See %(num)d person notes
sv: Se %(num)d person antäckningar

source: Place Notes
sv: Plats anteckningar

source: Relations
sv: Släktskap

source: Media files
sv: Media filer

source: Go to photo page
sv: Till fotosidan

source: crop
sv: beskär

source: Person Notes
sv: Person anteckningar

source: Source references
sv: Käll referens

source: Person's events
sv: Personens händelser

source: Keywords
sv: Sökord

source: Too recent for display to others!
sv: För ny för uppvisning till andra!

source: List of persons
sv: Person lista

source: Displaying %(num)s distinct persons
sv: Visar %(num)s personer

source: %(num)s person hidden because of privacy protection
sv: %(num)s person dolda på grund av integritetsskydd

source: No one found with search keys starting "%(name)s"
sv: Ingen hittades med Sök nycklar med start "%(name)s"

source: See family
sv: Granska familjen

source: Persons ordered by
sv: Personer sorterad enligt

source: Persons carrying a Name
sv: Personer bärande ett namn

source: Displaying %(num)s person, who may have lived during required years.
sv: Visning av %(num)s person, som kan ha bott under definerade år.

source: Displaying %(num)s person by name.
sv: Visning av en person efter namn.

source: If the person has many names, they may appear in the list under each name.
sv: Om personen har flera namn, så syns dem listade under vaje namn..

source: Under person's name there are the estimated possible life years determined by person data.
sv: Under personens namn finns de uppskattade möjliga livåren som avgöras av persondata.

source: Search term
sv: Sökfras

source: Any surname (beginning part)
sv: Valfritt efternamn (inledande)

source: Any firstname (beginning part)
sv: Valfritt förnamn (början del)

source: Firstname
sv: Förnamn

source: Any patronymic (beginning part)
sv: Valfritt patronymic (början del)

source: Patronymic
sv: Patronym

source: Free text (any name, can use wildcards)
sv: Namnsökning från alla namn (flera namn åtskiljs med mellanslag, trunkering med '*')

source: Free name search
sv: Frinamnsökning

source: Free text search from note texts (can use wildcards)
sv: Namnsökning från alla namn (flera namn åtskiljs med mellanslag, trunkering med '*')

source: Search from notes
sv: Sök från noten

source: A year (1750) or years range (1700-1750) where persons might live
sv: Ett år (1750) eller år intervall (1700-1750) där personer kan levas

source: Years range
sv: Period av åren

source: No one found with search keys
sv: Ingen hittad med sökorden

source: Place Details
sv: Plats detaljer

source: Invalid coordinates
sv: Ej giltiga koordinater

source: should be in decimal format
sv: skall vara i decimal format

source: OpenStreetMap on a larger scale
sv: OpenStreetMap i större skala

source: on Google Map
sv: i Google Map

source: Location
sv: Plats

source: Additional Information
sv: Mer information

source: No events
sv: Inga händelser

source: The required place was not found.
sv: Platsen hittades inte.

source: Places List
sv: Lista över platser

source: Displaying %(num)s distinct places
sv: Visning av %(num)s platser i

source: Starting letters of place
sv: Startbokstäver av plats

source: Location, related places
sv: Plats, relaterade platser

source: No references to place %(title)s
sv: Inga referenser till plats %(title)s

source: No places found
sv: Inga platser hittades

source: Repository and Sources
sv: Arkiv och källor

source: Repository Details
sv: Arkiv Detaljer

source: Sources in this Repository
sv: Källor i det här arkivet

source: Media type
sv: Media typ

source: Archieved
sv: Arkiverad

source: My profile, roles:
sv: Min profil med roller:

source: Events of a Source
sv: Händelser av en källa

source: Source Details
sv: Käll detaljer

source: Note!
sv: Märk!

source: Archieve not defined!
sv: Arkiv inte definierat!

source: Publishing info
sv: Utgivare info

source: Abbreviation
sv: Förkortning

source: Source References
sv: Käll referenser

source: Copy citation to clipboard
sv: Kopiera citergingen till clipboard

source: confidence
sv: konfidens

source: List of Sources
sv: Lista över källor

source: This page contains a directory of %(num)s sources.
sv: På sidan visasVälj serieVälj serie %(num)s källor.

source: Select series:
sv: Välj serie:

source: birth
sv: födda

source: baptism
sv: döpta

source: wedding
sv: gifta

source: death
sv: döda

source: move
sv: flyttade

source: Source, notes
sv: Källa, kompletterande uppgifter

source: Media in the repository
sv: Medlet i arkivet

source: events, persons, etc., referred from
sv: refererande händelser, personer, osv från

source: unused
sv: oanvänd

source: No sources found
sv: Inga källor hittades

source: Discussion (hide)
sv: Diskussion (dölj)

source: Your comment
sv: Din kommentar

source: Add comment
sv: Lägg till kommentar

source: Latest comments
sv: Sista kommentarer

source: Show discussion
sv: Visa diskussion

source: Load More Comments
sv: Mera kommentarer

source: Two-way fanchart
sv: Fläktgraf

source: Parents' family
sv: Föräldrarnas familj

source: family
sv: familj

source: Own families
sv: Egna familjer

source: As Parent in Family
sv: Som förälder i familj

source: Your name:
sv: Ditt namn:

source: Your email address:
sv: Din e-post adress:

source: Maximum 100 characters
sv: Maximum 100 tecken

source: Enter the email address
sv: Ange epost address

source: Are you a member of the Genealogical Society of Finland?
sv: Är du medlem i Genealogiska sällskapet i Finland?

source: How many years have you been doing genealogical research?
sv: Hur många år har du idkad genealogisk forskning?

source: What genealogy software are you mainly using?
sv: Vilken släktforsknings applikation använder du främst?

source: Which families/surnames are you mainly researching?
sv: Vilka familjer/efternamn forskar du främst?

source: Which places are you mainly researching?
sv: Vilka platser forskar du främst?

source: Send request
sv: Skicka begäran

source: Join message sent
sv: Meddelande om anslutning till Isotammi sent

source: Sending join message failed
sv: Sändninga av meddelandet misslyckats

source: Update did not work1
sv: Uppdateringen fungerade1 inte

source: Update did not work
sv: Uppdateringen fungerade inte

source: Isotammi User's Start Page
sv: Isotammi användarens start sida

source: User's home page for Isotammi Services
sv: Startsida till Isotammi Service

source: Use these Gedcom tools to improve the quality of your own file or any file you have recieved.
sv: Använd dessa Gedcom-verktyg för att förbättra kvaliteten på din egen fil eller annan fil som du har fått.

source: Return the improved file back to your genealogy software.
sv: Ladda den förbättrade filen tillbaka till din släktforskning programvara.

source: You may import your new material to Isotammi and work with existing materials.
sv: Här laddar du dina nya material och administrera dina förra material.

source: You may also check in which phase your materials are.
sv: Du kan också kolla skedena av dina materialen.

source: Look at your materials
sv: Listan över materialen

source: Browse Common Materials
sv: Bläddra i förenad material

source: View different approved common data
sv: Lista godkända gemensamma materialer

source: approved batches
sv: godkända materialen

source: Browse My Materials
sv: Bläddra mina material

source: In state
sv: Med status

source: Operations between user candidate materials and Isotammi database
sv: Operationer med forskarens material

source: Audit materials
sv: Granskarens åtgärder

source: Admin Operations
sv: Administrativa åtgärder

source: Manage users, reference data sets and do database maintenance tasks
sv: Hantera användare, referens data uppsättningar och uppgifter att managera databasen

source: Maintenance
sv: Underhåll

source: Tools and Links
sv: Verktyg och länkar
