Repository: Taapeli/stk-upload
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: sv

source: Undefined
sv: Odefinerad

source: Finnish
sv: Finska

source: Swedish
sv: Svenska

source: English
sv: Engelska

source: Email or Username
sv: Epost eller användarnamn

source: Password
sv: Lösenord

source: Remember Me
sv: Kom ihåg mig

source: Login
sv: Logga in

source: Email address
sv: Epost address

source: I have read and agree to the <a href='{terms_of_use_url}' target='esite'>{terms_of_use}</a>
sv: Jag har läst och samtyckt <a href='{terms_of_use_url}' target='esite'>till {terms_of_use}</a>

source: Terms of use
sv: Användarvillkoren

source: Register
sv: Registrera

source: Please indicate that you have read and agree to the Terms and Conditions
sv: Indikera att du har läst och godkänner användar vilkoren

source: Email has been reserved already
sv: Denna e-post redan reserverat

source: Username has been reserved already
sv: Användarnamnet redan reserverat

source: Username
sv: Användarnamn

source: Name
sv: Namn

source: Language
sv: Språk

source: Language required
sv: Språk som krävs

source: User name
sv: Användar namn

source: calculated
sv: beräknad

source: estimated
sv: värderad

source: {}from {}
sv: {}från {}

source: {}between {} … {}
sv: {}mellan {} … {}

source: {}about {}
sv: {}omkring {}

source: The event is not accessible
sv: Händelsen är inte tillgänglig

source: Participants read error
sv: Läsfel av deltagare

source: Place read error
sv: Läsfel av platser

source: Notes read error
sv: Läsfel för anteckningar

source: undefined relation
sv: odefinerad relation

source: This person has no families
sv: Denna person har inga familjer

source: GO TO START PAGE!
sv: GÅ TILL HUVUDSIDAN

source: Approved Isotammi tree
sv: Godkända materialen

source: Missing material_type or state
sv: Odefinerad material typ eller status

source: Undefined breed of materials
sv: Odefinerad material type

source: Child
sv: Barn

source: Daughter
sv: Dotter

source: sex not known
sv: kön inte känt

source: male
sv: man

source: female
sv: kvinna

source: sex not applicable
sv: kön inte tillämpligt

source: The year or years must be numeric
sv: Året måste vara numerisk

source: No persons found
sv: Inga personer hittades

source: Requested person not found
sv: Personen finns inte

source: Failed to retrieve batch
sv: Det gick inte att hämta materialet

source: User {} has not admin privileges
sv: Användare {} har inte administratörs behörighet

source: All data is deleted.
sv: All data har raderats

source: All data but users and roles are removed.
sv: All data utom användare och roller har raderats.

source: All persons and event by %(un)s are removed.
sv: Alla personer och händelser av %(un)s togs bort.

source: Removed %(cnt)d nodes
sv: Borttagna %(cnt)d noder

source: Given allowed email address already exists
sv: Angiven giltig epost address finns redan

source: Approved batch id %(batch_id)s with %(deleted)d nodes has been deleted
sv: Godkänt material-ID %(batch_id)s med %(deleted)d-noder har tagits bort

source: Removed excessive access '%(a)s' from batch %(b)s
sv: Granskaren '%(a)s' har ersätts i %(b)s

source: Superseded auditor '%(a)s' from batch %(b)s
sv: Granskaren '%(a)s' har ersätts i %(b)s

source: Events with no references to
sv: Händelser utan referenser till

source: Estimated time
sv: Beräknad tid

source: sec
sv: sek

source: Free text search indexes
sv: Fritt namnsökning index

source: Unable to open Gramps file
sv: Kan inte öppna Gramps fil

source: Material type
sv: Typ av materialet

source: Citations
sv: Citerings

source: Events
sv: Händelser

source: Families
sv: Familjer

source: Notes
sv: Anteckningar

source: People
sv: Personer

source: Places
sv: Platser

source: Repositories
sv: Arkiv

source: Sources
sv: Källor

source: Dates
sv: Datum

source: Family sorting names
sv: Familj sorteringsnamn

source: Person sorting names
sv: Person sorteringsnamn

source: Estimated lifetimes
sv: Beräknad livstider

source: Not valid field names "Name,Refname,Reftype,Source,Gender" {}
sv: Inte giltiga fält namn "namn, Refname, refType, källa, kön" {}

source: Id of the user
sv: Användarens id

source: Email Address:
sv: Epost address:

source: Username:
sv: Användar namn:

source: Name:
sv: Namn:

source: Name of the user
sv: Användarens namn

source: Is active
sv: Är aktiv

source: Active / passive user
sv: Aktiv / inaktiv användare

source: Roles
sv: Roll

source: Gedcom-files
sv: Gedcom-filer

source: Member
sv: Medlem

source: Research
sv: Forskare

source: Audit
sv: Granskning

source: Admin
sv: Administratör

source: Assigned roles
sv: Given roll

source: Email confirmed time
sv: Epost konfirmations tid

source: Time of email confirmation
sv: Tid när eposten konfirmerats

source: Last login time
sv: Senaste inloggnings tid

source: Time of last login
sv: Tid vid senaste inloggning

source: Last login IP address
sv: Senaste inloggningens IP address

source: IP address of last login
sv: IP address vid senaste inloggning

source: Current login time
sv: Nuvarande inloggnings tid

source: Time of current login
sv: Tid vid nuvarande inloggning

source: Current login IP address
sv: Nuvarande inloggningens IP address

source: IP address of current login
sv: IP address vid nuvarande inloggning

source: Login count
sv: Antal inloggningar

source: Count of logins
sv: Antal inloggningar

source: Update user
sv: Uppdatera användare

source: Approve user
sv: Godkänn användare

source: GSF_membership
sv: Medlem i Samfundet

source: Yes
sv: Ja

source: No
sv: Nej

source: Don't know
sv: Vet inte

source: Research years:
sv: Forskningsår:

source: research years
sv: forskningsår

source: Researched names:
sv: Undersökta namn:

source: Researched names
sv: Undersökta namn

source: Researched places:
sv: Undersökta platser:

source: Researched places
sv: Undersökta platser

source: Software:
sv: Släktprogram:

source: Genealogy software
sv: Släktprogram

source: Message:
sv: Meddelande:

source: Agreed to terms time
sv: Överenskommen villkorstid

source: The time when the user agreed to the terms and conditions
sv: Den tidpunkt då användaren gick med på villkoren

source: Database initial check done.
sv: Databasens inledande kontroll klar.

source: No empty batches removed
sv: Inga tomma batchar borttagna

source: Estimated {} person lifetimes
sv: Beräknade {} person livstider

source: Isotammi user approved
sv: Isotammi-användare godkänd

source: You are now approved to use Isotammi at {server} with user name {user}.
sv: Du är nu godkänd att använda Isotammi {server} med användarnamn {user}.

source: User updated
sv: Användaren uppdaterad

source: Data import from %(i)s to database has been started.
sv: Data importen från %(i)s till databasen har startats.

source: File not found
sv: Materialet finns inte

source: Management of access to batches
sv: Hantering av tillgång till satser

source: Add access for user
sv: Tilllägg inloggning för användare

source: to batchid
sv: till batchID

source: Add access
sv: Tilllägg inloggning

source: Current accesses
sv: Aktuella åtkomster

source: User
sv: Användare

source: Batch
sv: Materialet

source: Objects
sv: Objekt

source: Delete marked
sv: Radera markerad

source: Administrator
sv: Administratör

source: Are you sure you want to clear the database?
sv: Är du säker på att du vill rensa databasen?

source: Are you sure you want to delete your data?
sv: Är du säker på att du vill avlägsna dina data?

source: Isotammi Database Management Operations
sv: Operationer av Isotammi databas hantering

source: with roles
sv: med roller

source: Git Application Version
sv: Git Program version

source: Database Emptyings
sv: Databas tömmningar

source: Dangerous operations, which can not be undone!
sv: Farliga operationer, som inte kan ånras!

source: Clear the entire database
sv: Rensa hela databasen

source: Clear the database but save user IDs
sv: Rensa databasen men spara användar-ID: na

source: Delete all my imported data
sv: Tag bort allt mitt importerade data

source: Uploaded Candidate Materials
sv: Laddat kandidat material

source: Database refresh
sv: Uppdatering av databas

source: Safely check and initiate important nodes, constraints and schema fixes
sv: Kontrollera och initiera viktiga noder, begränsningar och schemafixar på ett säkert sätt

source: User and Material Management
sv: Användare och material underhåll

source: Users and roles table
sv: Tabell över användare och roller

source: Access management
sv: Hantering av inloggning

source: Data maintenance
sv: Underhåll av data

source: Set the estimated birth and death dates of a person
sv: Ange estimerade födelse och döds datum för personen

source: Build free text search indexes
sv: Bygg fritext indekser

source: Application management
sv: Programhantering

source: Display application log
sv: Visa program loggen

source: List all application pages
sv: Visa alla program sidor

source: Server statistics
sv: Serverstatistik

source: Empty batches
sv: Tomma batchar

source: Empty batches for user
sv: Tomma batchar för användare

source: Selected Batch
sv: Markerad material

source: Number of empty batches
sv: Antal tomma satser

source: Removed %(n)s batches
sv: Borttagna %(n)s batchar

source: The empty batches will be removed, except those which are created today.
sv: De tomma partierna kommer att tas bort, utom de som skapas idag.

source: Remove
sv: Försstöra

source: Free text indexes created
sv: Fritext index skapade

source: Return
sv: Tillbaka

source: GEDCOMs
sv: Gedcom filer

source: GEDCOMs for user
sv: Gedcom filer för användare

source: GEDCOMs for %(n)s users
sv: Gedcom filer för användare %(n)s

source: GEDCOMs for all users
sv: Gedcoms av alla användare

source: User id
sv: Användar id

source: GEDCOM file
sv: Gedcom fil

source: Number of files
sv: Antal av filer

source: List of users
sv: Lista över användare

source: Admin pages
sv: Administratörs sidor

source: Back to Front Page
sv: Till framsidan

source: My profile
sv: Min profil

source: The Genealogical Society of Finland
sv: Genealogiska Samfundet i Finland

source: Change settings
sv: Ändra inställningar

source: Select displayed data
sv: Välj data som visas

source: Admin home
sv: Admin start

source: Database Information
sv: Databas information

source: Active User names
sv: Namn på aktiva användare

source: Show
sv: Visa

source: all users
sv: alla användare

source: active users only
sv: aktiva användare endast

source: inactive users only
sv: inaktiva användare endast

source: Active
sv: Aktiv

source: Inactive
sv: Inaktiv

source: Edit me
sv: Redigera mig

source: Edit
sv: Redigera

source: No users
sv: Inga användare

source: Operations for selected users
sv: Åtgärder för valda användare

source: Gramps Files and Candidate Materials
sv: Gramps forskars material

source: Uploaded GEDCOMs
sv: Uppladdade Gedcom

source: Write email
sv: Skiv e-post

source: Gramps to Neo4j log
sv: Gramps till Neo4j log

source: Log of Gramps XML upload
sv: Log av Gramps XML uppladdning

source: Write Email to Users
sv: Skriv e-post till användare

source: Empty message – not sent!
sv: Ingen text – det gick inte att skicka meddelandet!

source: Message sent
sv: Meddelandet skickat

source: Message send failed
sv: Det gick inte att skicka meddelandet

source: Write Email to a User
sv: Skriv e-post till en användare

source: Write a message
sv: Skriv ett meddelande

source: Recievers
sv: Mottagare

source: Subject
sv: Ämne

source: Message from Isotammi admin
sv: Meddelande från Isotammi admin

source: Message
sv: Meddelande

source: Apply
sv: Tillämpa

source: Syslog
sv: Syslogg

source: Time
sv: Tid

source: Type
sv: Typ

source: Content
sv: Innehåll

source: Older events
sv: Äldre händelser

source: Newer events
sv: Nyare händelser

source: Back
sv: Tillbaka

source: User list
sv: Användar lista

source: Uploads
sv: Uppladdningar

source: Uploads for user
sv: Uppladdningar för användare

source: Uploads for %(n)s users
sv: Uppladdningar för %(n)s användare

source: Uploads for all users
sv: Uppladdningar för alla användare

source: Material
sv: Materialet

source: Type / description
sv: Typ / beskrivining

source: State
sv: Etapp

source: Operations
sv: Operationer

source: me
sv: mig

source: persons
sv: personer

source: Show log
sv: Visa logg

source: Delete file
sv: Radera fil

source: Audit request for
sv: Gransking önskad för

source: Withdrawing audit request for
sv: Återtagning av granskningsbegär för

source: failed
sv: misslyckades

source: succeeded
sv: lyckades

source: No such batch
sv: Ingen sådan material

source: You have given access permission for batch
sv: Du har nu tillträde till materialet

source: Your access for batch %(bid)s is OK
sv: Ditt tillträde till materialet %(bid)s är OK

source: You are now an auditor for batch
sv: Du är nu granskare för materialet

source: Audit batch accepted:
sv: Materialet i granskning godkänd:

source: You have rejected the audition of batch %(bid)s
sv: Du har avfärdat materialet %(bid)s

source: You did audit the batch %(bid)s for %(d)s days
sv: Du granskade materialet %(bid)s för %(d)s dagar

source: The file does not exist any more:
sv: Filen finns inte mera:

source: Not allowed to load this batch:
sv: Du kan inte öppna detta materialet:

source: Error in file loading
sv: Fel under uppladdningen av filen

source: Done
sv: Färdigt

source: Data type '{}' is not supported
sv: Data typen '{}' stöds inte

source: Missing proper column title:
sv: Giltigt kolumn namn fattas:

source: Auditions
sv: Inpektions

source: Are you sure you want to delete this batch from database?
sv: Är du säker på att du vill avlägsna denna material från databasen?

source: Approved batches
sv: Godkända materialen

source: Total <b>%(tot)s</b> objects
sv: Totalt <b>%(tot)s</b> objekt

source: Auditor
sv: Granskare

source: Researcher
sv: Forskare

source: Batch id
sv: Material id

source: Operations for
sv: Åtgärder för

source: the selected approved batch
sv: det valda materialet

source: Delete data
sv: Fösrstöra data

source: Delete from database
sv: Radera från Isotammi

source: Batches
sv: Materialen

source: Batch type
sv: Typ av materialet

source: Gramps file
sv: Gramps fil

source: User Profile
sv: Forskarens profil

source: Auditing started
sv: Granskningen har börjat

source: Show upload log
sv: Visa uppladdninslogget

source: Your audit operations
sv: Inspectionsåtgärder

source: Classifiers
sv: Klassifierande kategorier

source: Database
sv: I databasen

source: Translation
sv: Översättning

source: Inessive
sv: Inessive (inessive)

source: Isotammi auditor
sv: Isotammi granskare

source: Batch list
sv: Listan över materialen

source: Remove empty batches
sv: Radera tomma batchar

source: Experimental place merge
sv: Experimental sammanslagning av platser

source: Experimental duplicate person search
sv: Experimentell dubbelpersonssökning

source: Manage standard types
sv: Hantera definerade typer

source: Queries
sv: Databassökningar

source: List approved common data sets
sv: Lista godkända gemensamma satser

source: all
sv: alla

source: approved by me
sv: godkänt av mig

source: Reference names
sv: Referens namn

source: Classifier values
sv: Klassifierande kategorier

source: Audit home
sv: Inspektör hem

source: Instructions
sv: Instruktioner

source: Select auditiong operation
sv: Välj din inspections åtgärd

source: Auditing Researcher's Material
sv: Auditioning av forskarens material

source: Message from Isotammi auditor %(u)s
sv: Meddelande från Isotammi granskare %(u)s

source: Current auditors
sv: Granskare

source: Duration of audition
sv: Gransningens längd

source: Description
sv: Beskrivning

source: Access is given also to
sv: Tillgång ges också till

source: Objects Count
sv: Antalet av objecten

source: Total
sv: Totalt

source: Upload log
sv: Visa uppladdninslogget

source: Browse this material
sv: Bläddra materialet

source: You can browse, if you are currently auditing
sv: Du kan bläddra, om du är en aktiv granskare

source: Download file
sv: Ladda filen

source: You can download, if you are currently auditing
sv: Du kan öppna, om du är en aktiv granskare

source: Start as auditor (also the only way to delete the material)
sv: Starta granskningen (och kanske radera metarialet)

source: Supersede other auditor
sv: Ta över granskningen

source: Start auditing again
sv: Starta granskningen åter

source: Start auditing
sv: Starta granskningen

source: Accept auditing
sv: Godkänna granskningen

source: Include to accepted materials
sv: Inkludera till godkännade material

source: Withdraw
sv: Återta

source: Give up for now
sv: Avbryta

source: Reject auditing
sv: Avfärda granskningen

source: Dicard this material
sv: Överge granskningen

source: Delete batch
sv: Radera materialet

source: The material and files are deleted permanetly
sv: Material och filer raderade permanent

source: Logged on user
sv: Inloggad användare

source: Handling reference materials
sv: Behandling av referens material

source: Adding data
sv: Lägg till data

source: Download reference names
sv: Ladda ned referens namn

source: Destroying <u>all former</u> and creating a unique index
sv: Tar bort <u>alla föregående</u> och skapar ett unikt index

source: Upload
sv: Ladda upp

source: Handling reference names
sv: Behandlar referens namn

source: Listings
sv: Listor

source: List reference names
sv: Lista referens namn

source: See people with reference names
sv: Se personer med referens namn

source: Set changed reference names for all people
sv: Ange ändrade referensnamn för alla personer

source: After removal of all refnames
sv: Efter borttagning av alla refnames

source: Reference name Editor
sv: Referensnamn Editor

source: Download reference names as a CSV file
sv: Hämta referensnamn som en CSV-fil

source: User Settings
sv: Inställningar av användaren

source: Go back
sv: Tillbaka

source: Agreed to the <a href='{terms_of_use_url}' target='esite'>{terms_of_use}</a> at
sv: Gick med på <a href='{terms_of_use_url}' target='esite'>{terms_of_use}</a> på

source: Active Roles
sv: Aktiva roller

source: Candidate Materials
sv: Forskarens material

source: The amount of some data nodes included in your candidate data batches.
sv: Mängden av vissa dataenheter som ingår i dina material.

source: Approved %(n)s objects
sv: Godkända %(n)s-objekt

source: Data Batches
sv: Data Batcher

source: You have no candidate data loaded in the database.
sv: Du har inga material laddat till databasen.

source: Upload another file
sv: Ladda en annan fil

source: Set white list
sv: Inställ vita listan

source: Birth
sv: Födda

source: Baptism
sv: Döpta

source: Death
sv: Död

source: Burial
sv: Begravning

source: Compare possible duplicates
sv: Jämför potentiella dupliceringar

source: Family
sv: Familj

source: Wife
sv: Hustru

source: Children
sv: Barn

source: of type
sv: av typ

source: see details of place
sv: se detaljer om plats

source: iid
sv: isotammi-id

source: Names
sv: Namn

source: Parents
sv: Föräldrar

source: Duplicates search
sv: Söker duplikat

source: Find possible duplicates
sv: Hitta potentiella duplikanter

source: Select
sv: Välj

source: File
sv: Filen

source: Has search keys
sv: Har sök info

source: Search in
sv: Sök i

source: Search duplicates
sv: Sök duplikat

source: Generate comparison keys
sv: Generera jämförelse värden

source: Remove comparison keys
sv: Tag bort jämförelse värden

source: Missing iid values
sv: Ingen Isotammi-id

source: Compare
sv: Jämför

source: Compare2
sv: Jämför 2

source: GEDCOM Analyzer
sv: Gedcom-analysator

source: count=%(num)d, line %(lines)s
sv: antal =%(num)d, rad %(lines)s

source: Count
sv: Antal

source: Invalid tag hierarchy
sv: Ogiltig tagghierarki

source: No value
sv: Inget värde

source: Invalid dates
sv: Ogiltiga datum

source: Too many child tags
sv: För många underordnade Taggar

source: Records for submitters
sv: Poster för inlämnare

source: Families with no parents
sv: Familjer utan föräldrar

source: With sources
sv: Med källor

source: Without sources
sv: Utan källor

source: Places without hierarchy
sv: Platser utan hierarki

source: Possibly invalid surnames
sv: Eventuellt ogiltiga efternamn

source: Possibly invalid firstnames
sv: Möjligen ogiltiga förnamn

source: Genders
sv: Könen

source: Submitters
sv: Insändare

source: Missing paths
sv: Sökvägar som saknas

source: TYPEs for %(parent_path)s
sv: Typer för %(parent_path)s

source: Invalid pointers
sv: Ogiltiga pekare

source: Missing records
sv: Saknade poster

source: Unused records
sv: Oanvända poster

source: Gedcoms
sv: Gedcom

source: Current file
sv: Aktuell fil

source: File {} saved as {}
sv: Fil {} sparad som {}

source: Choose a GEDCOM file to upload
sv: Välj Gedcom för uppladdning

source: This GEDCOM file already exists
sv: Den här Gedcom-filen finns redan

source: You don't have permission to view that GEDCOM
sv: Du har inte behörighet att visa att Gedcom

source: That GEDCOM file does not exist on the server
sv: Gedcom filen finns inte på servern

source: Invalid line:
sv: Felaktig rad:

source: Invalid GEDCOM at line: {}
sv: Felaktig Gedcom vid rad: {}

source: Invalid GEDCOM; no level %s lines
sv: Felaktig Gedcom; inga nivå %s rader

source: Added:
sv: Tillagt:

source: Deleted:
sv: Raderade:

source: Replaced:
sv: Ersatta:

source: With:
sv: Med:

source: Transform '{}' started at {}
sv: Transformering '{}' startade vid {}

source: Name of the input GEDCOM file
sv: Inmatnings Gedcom filens namn

source: Name of the log file
sv: Loggfilens namn

source: Display changed rows
sv: Visa ändrade rader

source: Do not produce an output file
sv: Skapa inte en utdatafil

source: Do not produce a log in the output file
sv: Skapa inte logg i utdatafilen

source: Encoding of the input GEDCOM
sv: Kodning av Gedcom infilen

source: Total {num} change
sv: Totalt {num} andringar

source: File saved as {}
sv: Filen sparad som {}

source: Old file saved as {}
sv: Gamla versionen sparad som

source: Transform '{}' ended at {}
sv: Transformering '{}' slutade vid {}

source: Unsupported type:
sv: Ostödd typ:

source: Back to Top
sv: Till toppen

source: A Database of the Genealogical Society of Finland
sv: Genealogiska Samfundet i Finland's databas

source: Gedcom tools
sv: Gedcom-verktyg

source: user
sv: användare

source: Update description
sv: Beskrivning av uppdateringen

source: Allow help desk to view data
sv: Tillåt helpdesk att se data

source: Permission updated
sv: Behörighet uppdaterad

source: Show GEDCOM info
sv: Visa Gedcom-information

source: Switch to another GEDCOM
sv: Byt till annan Gedcom

source: Statistics
sv: Statistik

source: Upload time
sv: Uppladdad

source: File size
sv: Filstorlek

source: bytes
sv: bits

source: Gedcom date
sv: Gedcom-datum

source: Submitter
sv: Inskickat av

source: Encoding
sv: Avkodning

source: Gedcom charset
sv: Gedcom-teckenuppsättning

source: Source program
sv: Käll program

source: Number of individuals
sv: Antal individer

source: Number of families
sv: Antal familjer

source: Number of unique places
sv: Antal unika platser

source: Number of notes
sv: Antal noter

source: Number of citations
sv: Antal hänvisningar

source: Number of sources
sv: Antal källor

source: Number of repositories
sv: Antal arkiv

source: Number of multimedia objects
sv: Antal multimedia objekt

source: Actions
sv: Åtgärder

source: Choose a transformation to perform for this GEDCOM
sv: Välj en transformation som ska utföras för den här Gedcom

source: Choose a transformation
sv: Välj transformation

source: Display previous versions of this GEDCOM
sv: Visa tidigare versioner av denna Gedcom

source: Versions management
sv: Hantering av versioner

source: Fetch this GEDCOM
sv: Hämta denna Gedcom

source: Remove this GEDCOM
sv: Tag bort denna Gedcom

source: Technical analysis
sv: Teknisk analys

source: Show transformation history
sv: Visa transformation historik
