Repository: Taapeli/stk-upload
Catalog: stk_server/translations/*/LC_MESSAGES/messages.po
Languages: sv

source: Kieli
sv: Språk

source: Nimi
sv: Namn

source: Gedcomit
sv: Gedcom filer

source: Valitse ladattava gedcom-tiedosto
sv: Välj en gedcom fil att överföras

source: Toiminto vasta suunnitteilla
sv: Funktion planeras tillsvidare

source: Oletko varma?
sv: Vill Du såkert ta bort filen?

source: Ladattu
sv: Mottagen

source: Henkilöiden lukumäärä
sv: Antal av individer

source: Sallin neuvontapalvelun katselumahdollisuuden
sv: Stödfunktionärer får titta på mitt data

source: Muunnokset
sv: transformationer

source: Versiot
sv: Versioner

source: Poista GEDCOM
sv: Ta bort GEDCOM

source: Paluu
sv: Retur

source: Ladatut gedcomit:
sv: Mottagna gedcom filer:

source: kpl
sv: st.

source: Lataa uusi GEDCOM
sv: Överför ny GEDCOM

source: Lataa
sv: Överför

source: Muunnosparametrit
sv: Argumenter för transformation

source: Oletusarvo
sv: Förvalt värde

source: Lisää
sv: Foga in

source: Muunna
sv: Transformera

source: Muunnoksen tulostus
sv: utskrift av transformation

source: Lähetä salasanan elvyttämislinkki
sv: Skicka länk för uppdatering av lösenord

source: Rekisteröi uusi Suomitietokannan käyttäjäehdokas
sv: Registrera ny kandidat användare av Suomi-tietokanta

source: Rekisteröidy Suomitietokannan käyttäjäksi
sv: Registrera ny användare av Suomi-tietokanta

source: Lähetä vahvistamislinkki
sv: Skicka länk av bekräftelse
